const politicsQuestions = [
{
  id: 1,
  type: "单选题",
  question: "中国特色社会主义道路是( )。",
  options: { A: "实现途径", B: "行动指南", C: "根本保障", D: "精神力量" },
  answer: "A"
},
{
  id: 2,
  type: "单选题",
  question: "( )宣布，中国特色社会主义进入了新时代，这是我国发展新的历史方位。",
  options: { A: "党的十八大", B: "党的二十大", C: "党的十七大", D: "党的十九大" },
  answer: "D"
},
{
  id: 3,
  type: "单选题",
  question: "习近平总书记在十九大报告中指出，中国特色社会主义进入新时代，我国社会主要矛盾( )。",
  options: {
    A: "已经转化为人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾",
    B: "仍然是无产阶级同资产阶级之间的矛盾",
    C: "官僚资本同民族资本之间的矛盾",
    D: "是人民日益增长的物质文化需要同落后的社会生产之间的矛盾"
  },
  answer: "A"
},
{
  id: 4,
  type: "单选题",
  question: "( )是坚持和发展中国特色社会主义的行动指南。",
  options: { A: "党的基本路线", B: "党的基本理论", C: "党的基本方略", D: "党的基本政策" },
  answer: "B"
},
{
  id: 5,
  type: "单选题",
  question: "中国共产党为什么能，中国特色社会主义为什么好，归根到底是()。",
  options: {
    A: "马克思主义行，是中国化时代化的马克思主义行",
    B: "中国共产党能",
    C: "中国特色社会主义好",
    D: "靠坚持四项基本原则，不犯错误"
  },
  answer: "A"
},
{
  id: 6,
  type: "单选题",
  question: "()是当代中国发展进步的根本制度保障，具有明显制度优势。",
  options: { A: "中国特色社会主义制度", B: "中国特色社会主义经济制度", C: "中国特色社会主义理论体系", D: "中国特色社会主义道路" },
  answer: "A"
},
{
  id: 7,
  type: "单选题",
  question: "党的十八大以来,中国特色社会主义进入新时代，这是我国发展新的( )。",
  options: { A: "历史维度", B: "战略方向", C: "战略格局", D: "历史方位" },
  answer: "D"
},
{
  id: 8,
  type: "单选题",
  question: "( )是人类历史上的伟大创造，也是人类自我解放的伟大觉醒。",
  options: { A: "科学社会主义", B: "唯物史观", C: "社会主义革命", D: "中国特色社会主义" },
  answer: "A"
},
{
  id: 9,
  type: "单选题",
  question: "( )是更基础、更广泛、更深厚的自信，是一个国家、一个民族发展中最基本、最深沉、最持久的力量。",
  options: { A: "道路自信", B: "理论自信", C: "制度自信", D: "文化自信" },
  answer: "D"
},
{
  id: 10,
  type: "单选题",
  question: "( )是我国发展新的历史方位，标志着中国特色社会主义事业进入了新的发展阶段。",
  options: { A: "新时代", B: "新阶段", C: "新发展", D: "新时期" },
  answer: "A"
},
{
  id: 11,
  type: "单选题",
  question: "新时代我国社会主要矛盾的变化，是在社会主义初级阶段中发生的变化，( )对我国社会主义所处历史阶段的判断。",
  options: { A: "正在进行", B: "未能进行", C: "已经改变", D: "没有改变" },
  answer: "D"
},
{
  id: 12,
  type: "单选题",
  question: "科学社会主义在21世纪的中国焕发出新的蓬勃生机，( )为人类实现现代化提供了新的选择，中国共产党和中国人民为解决人类面临的共同问题提供更多更好的中国智慧、中国方案、中国力量，为人类和平与发展崇高事业作出新的更大的贡献!",
  options: { A: "中国式现代化", B: "中国特色社会主义", C: "供给侧结构性改革", D: "“四个全面”战略布局" },
  answer: "A"
},
{
  id: 13,
  type: "单选题",
  question: "党的十九大概括的以( )为主要内容的基本方略，涵盖了坚持党的全面领导和全面从严治党，涵盖了“五位一体”总体布局和“四个全面”战略布局，涵盖了国防和军队建设、维护国家安全。",
  options: { A: "十四个坚持", B: "四个全面", C: "五位一体", D: "六个必须" },
  answer: "A"
},
{
  id: 14,
  type: "单选题",
  question: "( )，是新的时代条件下坚持和发展中国特色社会主义、推进改革开放和社会主义现代化建设的战略抉择。",
  options: { A: "“十个明确”", B: "“十四个坚持”", C: "“四个全面”战略布局", D: "“五位一体”总体布局" },
  answer: "C"
}








];
export default politicsQuestions;

