const politicsQuestions = [
  {
    id: 1,
    chapter: 0,
    type: "单选题",
    question: "( )把习近平新时代中国特色社会主义思想写入党章。",
    options: {
      A: "党的十七大",
      B: "党的十八大",
      C: "党的十九大",
      D: "党的二十大"
    },
    answer: "C"
  },
  {
    id: 2,
    chapter: 0,
    type: "单选题",
    question: "2018年3月，(   )通过的宪法修正案，郑重地把习近平新时代中国特色社会主义思想载入宪法。",
    options: {
      A: "十三届全国人大一次会议",
      B: "十三届全国人大二次会议",
      C: "十三届全国人大三次会议",
      D: "十三届全国人大四次会议"
    },
    answer: "A"
  },
  {
    id: 3,
    chapter: 0,
    type: "单选题",
    question: "坚持和发展中国特色社会主义，总任务是( )。",
    options: {
      A: "完善和发展中国特色社会主义制度、推进国家治理体系和治理能力现代化",
      B: "建设中国特色社会主义法治体系、建设社会主义法治国家",
      C: "实现社会主义现代化和中华民族伟大复兴，在全面建成小康社会的基础上，分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国，以中国式现代化推进中华民族伟大复兴",
      D: "建设一支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成为世界一流军队"
    },
    answer: "C"
  },
  {
    id: 4,
    chapter: 0,
    type: "单选题",
    question: "全面深化改革的总目标是( )。",
    options: {
      A: "坚定道路自信、理论自信、制度自信、文化自信",
      B: "完善和发展中国特色社会主义制度、推进国家治理体系和治理能力现代化",
      C: "建设中国特色社会主义法治体系、建设社会主义法治国家",
      D: "坚持和发展中国特色社会主义"
    },
    answer: "B"
  },
  {
    id: 5,
    chapter: 0,
    type: "单选题",
    question: "世界未有之大变局正在加速演变。( )仍然是时代主题，但是不稳定不确定性更加突出。",
    options: {
      A: "发展与共享",
      B: "和平与融合",
      C: "和平与发展",
      D: "开放与包容"
    },
    answer: "C"
  },
  {
    id: 6,
    chapter: 0,
    type: "单选题",
    question: "中国特色社会主义的战略布局是( )。",
    options: {
      A: "“十个明确”",
      B: "“十四个坚持”",
      C: "“四个全面”",
      D: "“五位一体”"
    },
    answer: "C"
  },
  {
    id: 7,
    chapter: 0,
    type: "单选题",
    question: "中国特色社会主义的总体布局是( )。",
    options: {
      A: "“三位一体”",
      B: "“四位一体”",
      C: "“五位一体”",
      D: "“六位一体”"
    },
    answer: "C"
  },
  {
    id: 8,
    chapter: 0,
    type: "单选题",
    question: "( )是习近平新时代中国特色社会主义思想的主体内容，集中体现了这一思想体系的主要观点和基本精神，构成了这一思想体系的四梁八柱，发挥着统摄作用。",
    options: {
      A: "“四个全面”",
      B: "“十四个坚持”",
      C: "“十个明确”",
      D: "“四个伟大”"
    },
    answer: "C"
  },
  {
    id: 9,
    chapter: 0,
    type: "多选题",
    question: "习近平新时代中国特色社会主义思想创立的时代背景是(  )。",
    options: {
      A: "世界百年未有之大变局加速演进",
      B: "中华民族伟大复兴进入关键时期",
      C: "中国式现代化全面推进拓展",
      D: "科学社会主义在21世纪的中国焕发新的蓬勃生机",
      E: "中国共产党自我革命开辟新的境界"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 10,
    chapter: 0,
    type: "多选题",
    question: "习近平新时代中国特色社会主义思想回答了( )重大时代课题。",
    options: {
      A: "新时代坚持和发展什么样的中国特色社会主义、怎样坚持和发展中国特色社会主义",
      B: "建设什么样的社会主义现代化强国、怎样建设社会主义现代化强国",
      C: "建设什么样的长期执政的马克思主义政党、怎样建设长期执政的马克思主义政党",
      D: "建设什么美好的世界，怎样建设美好世界"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 11,
    chapter: 0,
    type: "多选题",
    question: "党的十九大、十九届六中全会提出的（   ）概括了习近平新时代中国特色社会主义思想的主要内容。",
    options: {
      A: "“十个明确”",
      B: "“十四个坚持”",
      C: "“十三个方面成就”"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 12,
    chapter: 0,
    type: "多选题",
    question: "“十四个坚持”的基本方略，( )。",
    options: {
      A: "涵盖坚持党的领导和“五位一体”总体布局、“四个全面”战略布局",
      B: "涵盖国防和军队建设、维护国家安全、对外战略",
      C: "是对党的治国理政重大方针政策的最新概括",
      D: "是实现“两个一百年”奋斗目标、实现中华民族伟大复兴中国梦的“路线图”和“方法论”"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 13,
    chapter: 0,
    type: "多选题",
    question: "习近平新时代中国特色社会主义思想是当代中国马克思主义、二十一世纪马克思主义，是( )的时代精华，实现了马克思主义中国化新的飞跃。",
    options: {
      A: "中华文化",
      B: "中华品格",
      C: "中国精神",
      D: "中国力量"
    },
    answer: ["A", "C"]
  },
  {
    id: 14,
    chapter: 0,
    type: "多选题",
    question: "坚持把马克思主义基本原理同( )相结合，用马克思主义观察时代、把握时代、引领时代，继续发展当代中国马克思主义、21世纪马克思主义。",
    options: {
      A: "中国具体实际相结合",
      B: "中华优秀传统文化",
      C: "中国精神",
      D: "民族特色"
    },
    answer: ["A", "B"]
  },
  {
    id: 15,
    chapter: 0,
    type: "多选题",
    question: "中国特色社会主义事业总体布局是“五位一体”、战略布局是“四个全面”，强调坚定( )。",
    options: {
      A: "道路自信",
      B: "理论自信",
      C: "制度自信",
      D: "文化自信"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 16,
    chapter: 0,
    type: "多选题",
    question: "发展是解决我国一切问题的基础和关键，发展必须是科学发展，必须坚定不移贯彻“创新、( )”的发展理念。",
    options: {
      A: "协调",
      B: "绿色",
      C: "开放",
      D: "共享"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 17,
    chapter: 0,
    type: "多选题",
    question: "建设一支( )的人民军队，是实现“两个一百年”奋斗目标、实现中华民族伟大复兴的战略支撑。",
    options: {
      A: "听党指挥",
      B: "能打胜仗",
      C: "作风优良",
      D: "全心全意为人民服务"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 18,
    chapter: 0,
    type: "多选题",
    question: "“两个确立”形成的依据是( )。",
    options: {
      A: "“两个确立”是中国共产党基于唯物史观两个基本原理所作出的必然选择",
      B: "“两个确立”是党的历史经验的总结运用",
      C: "“两个确立”是新时代十年实践形成的智慧结晶",
      D: "“两个确立”是战胜外部环境变化出现许多新的风险挑战、解决国内许多深层次矛盾和问题的需要"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 19,
    chapter: 0,
    type: "判断题",
    question: "科学社会主义在21世纪的中国焕发新的蓬勃生机。( )",
    options: {
      A: "正确",
      B: "错误"
    },
    answer: "A"
  },
  {
    id: 20,
    chapter: 0,
    type: "判断题",
    question: "以习近平同志为核心的党中央坚定不移坚持和加强党的全面领导，坚定不移地推进全面从严治党，找到了人民民主这个跳出治乱兴衰周期率的第二个答案。(  )",
    options: {
      A: "正确",
      B: "错误"
    },
    answer: "B"
  },
  {
    id: 21,
    chapter: 0,
    type: "判断题",
    question: "习近平新时代中国特色社会主义思想，是党和人民实践经验和集体智慧的结晶，主要创立者是习近平。(   )",
    options: {
      A: "正确",
      B: "错误"
    },
    answer: "A"
  },
  {
    id: 22,
    chapter: 0,
    type: "判断题",
    question: "“十四个坚持”是习近平新时代中国特色社会主义思想的主体内容，构成了这一思想体系的四梁八柱，发挥着统摄作用。(   )",
    options: {
      A: "正确",
      B: "错误"
    },
    answer: "B"
  },
  {
    id: 23,
    chapter: 0,
    type: "判断题",
    question: "2018年3月，十三届全国人大一次会议通过的宪法修正案，郑重的把习近平新时代中国特色社会主义思想载入宪法。(  )",
    options: {
      A: "正确",
      B: "错误"
    },
    answer: "A"
  },
  {
    id: 24,
    chapter: 0,
    type: "判断题",
    question: "习近平新时代中国特色社会主义思想是全党全国各族人民为实现中华民族伟大复兴而奋斗的行动指南。(  )",
    options: {
      A: "正确",
      B: "错误"
    },
    answer: "A"
  },
  {
    id: 25,
    chapter: 1,
    type: "单选题",
    question: "中国特色社会主义道路是( )。",
    options: {
      A: "实现途径",
      B: "行动指南",
      C: "根本保障",
      D: "精神力量"
    },
    answer: "A"
  },
  {
    id: 26,
    chapter: 1,
    type: "单选题",
    question: "( )宣布，中国特色社会主义进入了新时代，这是我国发展新的历史方位。",
    options: {
      A: "党的十八大",
      B: "党的二十大",
      C: "党的十七大",
      D: "党的十九大"
    },
    answer: "D"
  },
  {
    id: 27,
    chapter: 1,
    type: "单选题",
    question: "习近平总书记在十九大报告中指出，中国特色社会主义进入新时代，我国社会主要矛盾( )。",
    options: {
      A: "是人民日益增长的美好生活需要同不平衡不充分的发展之间的矛盾",
      B: "仍然是无产阶级同资产阶级之间的矛盾",
      C: "官僚资本同民族资本之间的矛盾",
      D: "是人民日益增长的物质文化需要同落后的社会生产之间的矛盾"
    },
    answer: "A"
  },
  {
    id: 28,
    chapter: 1,
    type: "单选题",
    question: "( )是坚持和发展中国特色社会主义的行动指南。",
    options: {
      A: "党的基本路线",
      B: "党的基本理论",
      C: "党的基本方略",
      D: "党的基本政策"
    },
    answer: "B"
  },
  {
    id: 29,
    chapter: 1,
    type: "单选题",
    question: "中国共产党为什么能，中国特色社会主义为什么好，归根到底是( )。",
    options: {
      A: "马克思主义行，是中国化时代化的马克思主义行",
      B: "中国共产党能",
      C: "中国特色社会主义好",
      D: "靠坚持四项基本原则，不犯错误"
    },
    answer: "A"
  },
  {
    id: 30,
    chapter: 1,
    type: "单选题",
    question: "()是当代中国发展进步的根本制度保障，具有明显制度优势。",
    options: {
      A: "中国特色社会主义道路",
      B: "中国特色社会主义制度",
      C: "中国特色社会主义理论",
      D: "中国特色社会主义文化"
    },
    answer: "B"
  },
  {
    id: 31,
    chapter: 1,
    type: "单选题",
    question: "党的十八大以来，中国特色社会主义进入新时代，这是我国发展新的( )。",
    options: {
      A: "历史阶段",
      B: "发展方位",
      C: "发展目标",
      D: "历史方位"
    },
    answer: "D"
  },
  {
    id: 32,
    chapter: 1,
    type: "单选题",
    question: "( )是人类历史上的伟大创造，也是人类自我解放的伟大觉醒。",
    options: {
      A: "中国共产党",
      B: "社会主义制度",
      C: "中国特色社会主义",
      D: "马克思主义"
    },
    answer: "C"
  },
  {
    id: 33,
    chapter: 1,
    type: "单选题",
    question: "( )是更基础、更广泛、更深厚的自信，是一个国家、一个民族发展中最基本、最深沉、最持久的力量。",
    options: {
      A: "道路自信",
      B: "理论自信",
      C: "制度自信",
      D: "文化自信"
    },
    answer: "D"
  },
  {
    id: 34,
    chapter: 1,
    type: "单选题",
    question: "( )是我国发展新的历史方位，标志着中国特色社会主义事业进入了新的发展阶段。",
    options: {
      A: "新时代",
      B: "新阶段",
      C: "新发展",
      D: "新时期"
    },
    answer: "A"
  },
  {
    id: 35,
    chapter: 1,
    type: "单选题",
    question: "新时代我国社会主要矛盾的变化，是在社会主义初级阶段中发生的变化，( )对我国社会主义所处历史阶段。",
    options: {
      A: "正在进行",
      B: "未能进行",
      C: "已经改变",
      D: "没有改变"
    },
    answer: "D"
  },
  {
    id: 36,
    chapter: 1,
    type: "单选题",
    question: "科学社会主义在21世纪的中国焕发出新的蓬勃生机，( )为人类实现现代化提供了新的选择。",
    options: {
      A: "中国式现代化",
      B: "中国特色社会主义",
      C: "供给侧结构性改革",
      D: "“四个全面”战略布局"
    },
    answer: "A"
  },
  {
    id: 37,
    chapter: 1,
    type: "单选题",
    question: "党的十九大概括的以( )为主要内容的基本方略，涵盖了坚持党的全面领导和全面从严治党，涵盖了“四个全面”战略布局等。",
    options: {
      A: "“十个明确”",
      B: "“十四个坚持”",
      C: "“十三个方面”",
      D: "“六个必须坚持”"
    },
    answer: "B"
  },
  {
    id: 38,
    chapter: 1,
    type: "单选题",
    question: "( )，是新的时代条件下坚持和发展中国特色社会主义、推进改革开放和社会主义现代化建设的战略抉择。",
    options: {
      A: "“十个明确”",
      B: "“十四个坚持”",
      C: "“四个全面”战略布局",
      D: "“五位一体”总体布局"
    },
    answer: "C"
  },
  {
    id: 39,
    chapter: 1,
    type: "多选题",
    question: "中国特色社会主义是( )。",
    options: {
      A: "在改革开放40多年的伟大实践中得来的",
      B: "在新中国成立70多年的持续探索中得来的",
      C: "在中国共产党领导人民进行伟大社会革命100多年的实践中得来的",
      D: "在世界社会主义500多年波澜壮阔的发展历程中得来的",
      E: "在对中华文明5000多年的传承发展中得来的。"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 40,
    chapter: 1,
    type: "多选题",
    question: "中国特色社会主义坚持科学社会主义基本原则，并赋予其鲜明的中国特色,包括( )。",
    options: {
      A: "坚持人民代表大会制度的根本政治制度",
      B: "中国共产党领导的多党合作和政治协商制度",
      C: "坚持公有制为主体多种所有制经济共同发展",
      D: "坚持按劳分配为主体多种分配方式并存",
      E: "坚持社会主义市场经济体制"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 41,
    chapter: 1,
    type: "多选题",
    question: "改革开放以来，我们取得一切成绩和进步的根本原因，就是( )。",
    options: {
      A: "形成了中国特色社会主义理论体系",
      B: "确立了中国特色社会主义制度",
      C: "发展了中国特色社会主义文化",
      D: "建设社会主义生态文明"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 42,
    chapter: 1,
    type: "多选题",
    question: "中国特色社会主义进入了新时代的判断，是( )。",
    options: {
      A: "基于我国发展进入新阶段的伟大成就",
      B: "基于社会主要矛盾发生新变化",
      C: "基于党的新的奋斗目标",
      D: "基于我国面临新的国际环境。"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 43,
    chapter: 1,
    type: "多选题",
    question: "中国特色社会主义新时代，( )。",
    options: {
      A: "是承前启后、继往开来，在新的历史条件下继续夺取中国特色社会主义伟大胜利的时代",
      B: "是决胜全面建成小康社会、进而全面建设社会主义现代化强国的时代",
      C: "是全国各族人民团结奋斗、不断创造美好生活、逐步实现全体人民共同富裕的时代",
      D: "全体中华儿女勠力同心、奋力实现中华民族伟大复兴中国梦的时代"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 44,
    chapter: 1,
    type: "多选题",
    question: "党的十九大概括中国特色社会主义进入新时代的重大意义,这就是（  ）",
    options: {
      A: "意味着中华民族迎来了从站起来、富起来到强起来的伟大飞跃，迎来了中华民族伟大复兴的光明前景。",
      B: "意味着科学社会主义在中国焕发出强大生机活力，在世界上高高举起了中国特色社会主义伟大旗帜",
      C: "意味着中国特色社会主义道路、理论、制度、文化不断发展，拓展了发展中国家实现现代化的途径",
      D: "意味着中国即将建成社会主义现代化强国，全体人民过上共同富裕的生活。"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 45,
    chapter: 1,
    type: "多选题",
    question: "中国特色社会主义制度，()。",
    options: {
      A: "坚持把根本制度、基本制度、重要制度以及各方面体制机制等具体制度有机结合起来",
      B: "坚持把国家层面民主制度同基层民主制度有机结合起来",
      C: "坚持把党的领导、人民当家作主、依法治国有机结合起来",
      D: "既坚持了社会主义的根本性质，又借鉴了古今中外制度建设的有益成果"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 46,
    chapter: 1,
    type: "多选题",
    question: "历史和实践充分证明，( )才能实现中华民族伟大复兴。",
    options: {
      A: "只有社会主义才能救中国",
      B: "只有社会主义才能发展中国",
      C: "只有坚持和发展中国特色社会主义",
      D: "只有坚持世界大国地位"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 47,
    chapter: 1,
    type: "多选题",
    question: "新时代坚持和发展中国特色社会主义，必须坚定( )。",
    options: {
      A: "道路自信",
      B: "理论自信",
      C: "制度自信",
      D: "文化自信"
    },
    answer: ["A", "B", "C", "D"]
  },



  {
    id: 48,
    chapter: 1,
    type: "多选题",
    question: "我们党领导人民完成了( )的主要任务，为实现中华民族伟大复兴提供了重要的基础和保证。",
    options: {
      A: "新民主主义革命时期",
      B: "社会主义革命和建设时期",
      C: "改革开放和社会主义现代化建设新时期",
      D: "中国特色社会主义新时代"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 49,
    chapter: 1,
    type: "多选题",
    question: "我们既要看到我国社会主要矛盾发生的变化，也要看到我国仍处于并将长期处于( )的基本国情没有变，我国是( )的国际地位没有变。",
    options: {
      A: "社会主义初级阶段",
      B: "社会主义发展阶段",
      C: "世界最大发展中国家",
      D: "世界最大影响力国家"
    },
    answer: ["A", "C"]
  },
  {
    id: 50,
    chapter: 1,
    type: "多选题",
    question: "进入新时代，以习近平同志为核心的党中央准确把握我国发展新的历史方位，不断深化对中国特色社会主义建设规律的认识，……解决了许多长期想解决而没有解决的难题，办成了许多过去想办而没有办成的大事，党和国家事业( ),推动我国迈上全面建设社会主义现代化国家新征程。",
    options: {
      A: "实现历史性跨越",
      B: "取得历史性成就",
      C: "发生历史性变革",
      D: "创造历史性发展"
    },
    answer: ["B", "C"]
  },
  {
    id: 51,
    chapter: 1,
    type: "多选题",
    question: "全面从严治党不断深化，党的( )能力显著增强，管党治党宽松软状况得到根本扭转，反腐败斗争取得压倒性胜利并全面巩固……",
    options: {
      A: "自我净化",
      B: "自我完善",
      C: "自我革新",
      D: "自我提高"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 52,
    chapter: 1,
    type: "多选题",
    question: "走过百年奋斗历程的中国共产党在革命性锻造中更加坚强有力，党的( )显著增强，党同人民群众始终保持血肉联系。",
    options: {
      A: "政治领导力",
      B: "思想引领力",
      C: "群众组织力",
      D: "社会号召力"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 53,
    chapter: 1,
    type: "判断题",
    question: "我国的基本国情发生了变化，我国的国际地位发生了变化。( )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 54,
    chapter: 1,
    type: "判断题",
    question: "理论自信是更基础、更广泛、更深厚的自信，是一个国家、一个民族发展中最基本、最深沉、最持久的力量。( )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 55,
    chapter: 1,
    type: "判断题",
    question: "我国是世界上最大的的发展中国家。( )",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 56,
    chapter: 1,
    type: "判断题",
    question: "新时代我国社会主要矛盾的变化，是在社会主义初级阶段中发生的变化，改变了对我国社会主义所处历史阶段的判断。( )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 57,
    chapter: 1,
    type: "判断题",
    question: "中国特色社会主义是人类历史上的伟大创造，也是人类自我解放的伟大觉醒。( )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 58,
    chapter: 1,
    type: "判断题",
    question: "人民代表大会制度是我国的基本政治制度。( )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 59,
    chapter: 2,
    type: "单选题",
    question: "习近平指出：“一百年来，中国共产党团结带领中国人民进行的一切奋斗、一切牺牲、一切创造，归结起来就是一个主题：（ ）。”",
    options: {
      A: "建立新中国",
      B: "追求共同富裕",
      C: "实现中华民族伟大复兴",
      D: "改革开放"
    },
    answer: "C"
  },
  {
    id: 60,
    chapter: 2,
    type: "单选题",
    question: "全面建成小康社会是实现中华民族伟大复兴中国梦的关键一步。要在全面建成小康社会的基础上，分（ ）全面建成富强民主文明和谐美丽的社会主义现代化强国，全面推进中华民族伟大复兴。",
    options: {
      A: "层次走",
      B: "两步走",
      C: "三步走",
      D: "步骤走"
    },
    answer: "B"
  },
  {
    id: 61,
    chapter: 2,
    type: "单选题",
    question: "实现中华民族伟大复兴的中国梦，本质是国家富强、民族振兴、人民幸福。国家富强，就是要在（ ）基础上，全面建成富强民主文明和谐美丽的社会主义现代化强国。",
    options: {
      A: "全面建成小康社会",
      B: "打赢脱贫攻坚战",
      C: "基本实现现代化",
      D: "全面依法治国"
    },
    answer: "A"
  },
  {
    id: 62,
    chapter: 2,
    type: "单选题",
    question: "全面建成小康社会，强调的不仅是’小康’，而且更重要的也是更难做到的是‘（ ）’。",
    options: {
      A: "共同富裕",
      B: "公平",
      C: "平均",
      D: "全面"
    },
    answer: "D"
  },
  {
    id: 63,
    chapter: 2,
    type: "单选题",
    question: "（ ）作出了从全面建成小康社会到基本实现社会主义现代化，再到全面建成社会主义现代化强国的战略安排。",
    options: {
      A: "党的十七大",
      B: "党的十八大",
      C: "党的十九大",
      D: "党的二十大"
    },
    answer: "C"
  },
  {
    id: 64,
    chapter: 2,
    type: "单选题",
    question: "全面建成社会主义现代化强国总的战略安排的第二步是，在基本实现社会主义现代化的基础上，到（ ），把我国建设成为富强民主文明和谐美丽的社会主义现代化强国。",
    options: {
      A: "建党一百周年",
      B: "2020年",
      C: "2035年",
      D: "本世纪中叶"
    },
    answer: "D"
  },
  {
    id: 65,
    chapter: 2,
    type: "单选题",
    question: "从全面建设社会主义现代化国家进程的阶段安排看来，到2035年，我国将（ ）。",
    options: {
      A: "全面建成小康社会",
      B: "全面实现现代化",
      C: "实现中华民族伟大复兴的中国梦",
      D: "基本实现社会主义现代化"
    },
    answer: "D"
  },
  {
    id: 66,
    chapter: 2,
    type: "单选题",
    question: "中国式现代化，是中国共产党领导的社会主义现代化，既有各国现代化的共同特征，更有基于自己国情的中国特色。党的（ ）集中概括了中国式现代化五个方面的中国特色。",
    options: {
      A: "十七大",
      B: "十八大",
      C: "十九大",
      D: "二十大"
    },
    answer: "D"
  },
  {
    id: 67,
    chapter: 2,
    type: "单选题",
    question: "我国全体人民整体迈进现代化，（ ）超过现有发达国家的总和，将极大改变现代化的世界版图。习近平指出：“在我国这样一个十四亿人口的国家实现社会主义现代化，这是多么伟大、多么不易！”",
    options: {
      A: "人口规模",
      B: "经济总量",
      C: "科技水平",
      D: "文化影响力"
    },
    answer: "A"
  },
  {
    id: 68,
    chapter: 2,
    type: "单选题",
    question: "中国式现代化是造福人民的现代化。（ ）是推进现代化最坚实的根基、最深厚的力量。推进中国式现代化，必须维护人民根本利益，增进民生福祉，不断实现发展为了人民、发展依靠人民、发展成果由人民共享，让现代化建设成果更多更公平惠及全体人民。",
    options: {
      A: "经济发展",
      B: "科技创新",
      C: "政策支持",
      D: "人民"
    },
    answer: "D"
  },
  {
    id: 69,
    chapter: 2,
    type: "多选题",
    question: "新时代新征程中国共产党的中心任务，就是（ ）。",
    options: {
      A: "团结带领全国各族人民全面建成社会主义现代化强国",
      B: "实现第二个百年奋斗目标",
      C: "以中国式现代化全面推进中华民族伟大复兴。",
      D: "实现小康"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 70,
    chapter: 2,
    type: "多选题",
    question: "实现中华民族伟大复兴的中国梦，本质是（ ）。",
    options: {
      A: "国家富强",
      B: "世界和平",
      C: "民族振兴",
      D: "人民幸福"
    },
    answer: ["A", "C", "D"]  // Adjust according to sheet: 实质是国家富强、人民幸福? But sheet says ACD
  },
  {
    id: 71,
    chapter: 2,
    type: "多选题",
    question: "党的二十大进一步明确，全面建成社会主义现代化强国总的战略安排是分两步走：( )。",
    options: {
      A: "从2017年到2037年在全面建成小康社会的基础上，再奋斗15年，基本实现社会主义现代化",
      B: "从2037年到本世纪中叶在基本实现现代化的基础上，再奋斗15年，把我国建成富强民主文明和谐美丽的社会主义现代化强国",
      C: "从2020年到2035年基本实现社会主义现代化",
      D: "从2035年到本世纪中叶把我国建成富强民主文明和谐美丽的社会主义现代化强国。"
    },
    answer: ["C", "D"]
  },
  {
    id: 72,
    chapter: 2,
    type: "多选题",
    question: "推进中国式现代化需要牢牢把握的重大原则是（）。",
    options: {
      A: "坚持党的全面领导",
      B: "坚持中国特色社会主义道路",
      C: "坚持以人民为中心的发展思想",
      D: "坚持深化改革开放",
      E: "坚持发扬斗争精神"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 73,
    chapter: 2,
    type: "多选题",
    question: "推进中国式现代化需要正确处理的重大关系是（）。",
    options: {
      A: "正确处理顶层设计与实践探索的关系",
      B: "正确处理战略与策略的关系",
      C: "正确处理守正与创新的关系",
      D: "正确处理效率与公平的关系",
      E: "正确处理独立自主与对外开放的关系"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 74,
    chapter: 2,
    type: "多选题",
    question: "中国梦是（ ）的梦，中国人民愿意同各国人民在实现各自梦想的过程中相互支持、相互帮助，在推动实现持久和平、共同繁荣世界梦的崇高事业中作出更大贡献。",
    options: {
      A: "和平",
      B: "发展",
      C: "合作",
      D: "共赢"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 75,
    chapter: 2,
    type: "多选题",
    question: "习近平指出：“全面建成小康社会，强调的不仅是‘小康’，而且更重要的也是更难做到的是‘全面'。‘小康’讲的是发展水平，‘全面'讲的是发展的（ ）。",
    options: {
      A: "平衡性",
      B: "协调性",
      C: "可持续性",
      D: "平均性"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 76,
    chapter: 2,
    type: "多选题",
    question: "2021年7月1日，习近平在庆祝中国共产党成立100周年大会上庄严宣告：“经过全党全国各族人民持续奋斗，我们实现了第一个百年奋斗目标，正在意气风发向着全面建成社会主义现代化强国的第二个百年奋斗目标迈进。”下列关于全面建成小康社会的说法正确的是（）。",
    options: {
      A: "全面建成小康社会，成效卓著、成果丰硕、成色十足。",
      B: "全面建成小康社会，高质量完成了社会主义现代化建设“三步走”战略的第二步，使中华民族伟大复兴向前迈出新的一大步。",
      C: "全面建成小康社会，探索了人类解决贫困问题的新路径，为推动人类文明进步作出了重大贡献。",
      D: "全面建成小康社会，就是我们的终点"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 77,
    chapter: 2,
    type: "多选题",
    question: "中国式现代化的中国特色是（ ）。",
    options: {
      A: "人口规模巨大的现代化",
      B: "全体人民共同富裕的现代化",
      C: "物质文明和精神文明相协调的现代化",
      D: "人与自然和谐共生的现代化",
      E: "走和平发展道路的现代化"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 78,
    chapter: 2,
    type: "判断题",
    question: "中国式现代化是一项伟大而艰巨的事业，前进道路必然风雨兼程，需要全党全国各族人民团结奋斗的步调更加一致、意志更加顽强。目前我国已经实现现代化。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 79,
    chapter: 2,
    type: "判断题",
    question: "中国式现代化是人口规模巨大的现代化。这是中国式现代化区别于西方现代化的显著标志。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 80,
    chapter: 2,
    type: "判断题",
    question: "中国式现代化是全体人民共同富裕的现代化，强调发展成果共享、发展过程共享。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 81,
    chapter: 2,
    type: "判断题",
    question: "中国式现代化是物质文明和精神文明相协调的现代化，强调经济、政治、文化、社会、生态文明融合发展。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 82,
    chapter: 2,
    type: "判断题",
    question: "中国式现代化是人与自然和谐共生的现代化，强调绿色发展和可持续发展。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 83,
    chapter: 2,
    type: "判断题",
    question: "中国式现代化是走和平发展道路的现代化，倡导与世界各国和平共处、共同发展。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 84,
    chapter: 2,
    type: "判断题",
    question: "中国式现代化不提供他国示范路径，每个国家都必须独立探索中国特色社会主义现代化道路。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 85,
    chapter: 2,
    type: "判断题",
    question: "中国特色社会主义进入新时代，社会主要矛盾已经转化为人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 86,
    chapter: 2,
    type: "判断题",
    question: "新时代坚持和发展中国特色社会主义，必须坚持党的全面领导、坚持以人民为中心、坚持改革开放等基本方略。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 87,
    chapter: 2,
    type: "判断题",
    question: "实现中华民族伟大复兴是一个接续推进的历史过程。改革开放之初，我们党在设计我国社会主义现代化蓝图时，结合中国实际提出从解决温饱、实现小康进而基本实现现代化的“三步走”发展战略。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 88,
    chapter: 3,
    type: "单选题",
    question: "习近平指出：“一定要认清，中国最大的国情就是（ ）。什么是中国特色？这就是中国特色。”",
    options: {
      A: "人口14亿",
      B: "中国共产党的领导",
      C: "人均GDP世界第二",
      D: "世界上最大的发展中国家"
    },
    answer: "B"
  },
  {
    id: 89,
    chapter: 3,
    type: "单选题",
    question: "维护党中央权威和集中统一领导，最关键的是（ ）。",
    options: {
      A: "坚决维护习近平同志党中央的核心、全党的核心地位",
      B: "实行民主集中制",
      C: "修改党章，加强党中央权力",
      D: "修改党章，加强党中央权力"
    },
    answer: "A"
  },
  {
    id: 90,
    chapter: 3,
    type: "单选题",
    question: "中国共产党领导是国家治理体系的核心，（ ）是中国特色社会主义制度建设的关键。",
    options: {
      A: "人民代表大会制度",
      B: "党的领导制度",
      C: "社会主义制度",
      D: "社会主义制度"
    },
    answer: "B"
  },
  {
    id: 91,
    chapter: 3,
    type: "单选题",
    question: "（ ）是中国特色社会主义最本质的特征。",
    options: {
      A: "以经济建设为中心",
      B: "以人为本",
      C: "“五位一体总体布局”",
      D: "中国共产党的领导"
    },
    answer: "D"
  },
  {
    id: 92,
    chapter: 3,
    type: "单选题",
    question: "我国国家制度和国家治理体系具有多方面的显著优势，其中最大的优势是（ ）。",
    options: {
      A: "立党为公、执政为民",
      B: "中国共产党领导",
      C: "全心全意为人民服务",
      D: "改革开放"
    },
    answer: "B"
  },
  {
    id: 93,
    chapter: 3,
    type: "单选题",
    question: "中国共产党是以（ ）为根本组织原则和领导制度的马克思主义政党。",
    options: {
      A: "群众路线",
      B: "民主集中制",
      C: "党章",
      D: "政治纪律"
    },
    answer: "B"
  },
  {
    id: 94,
    chapter: 3,
    type: "单选题",
    question: "维护（ ），是一个成熟的马克思主义执政党的重大建党原则。",
    options: {
      A: "中国特色社会主义制度",
      B: "人民当家作主",
      C: "全面依法治国",
      D: "党中央权威和集中统一领导"
    },
    answer: "D"
  },
  {
    id: 95,
    chapter: 3,
    type: "单选题",
    question: "中国共产党以（ ）作为行动指南，在实践中不断推进马克思主义中国化时代化，为坚持和完善中国特色社会主义提供了根本指引。",
    options: {
      A: "马克思主义中国化时代化",
      B: "人民共同富裕",
      C: "马克思主义",
      D: "如期全面建成小康社会"
    },
    answer: "C"
  },
  {
    id: 96,
    chapter: 3,
    type: "单选题",
    question: "（ ）是中国特色社会主义制度优势的主要来源。",
    options: {
      A: "中国共产党的自身优势",
      B: "科学社会主义",
      C: "社会主义改革开放",
      D: "“两个一百年”"
    },
    answer: "A"
  },
  {
    id: 97,
    chapter: 3,
    type: "多选题",
    question: "中国共产党作为最高政治领导力量，在党和国家事业发展中居于中心地位。党的领导是（ ），必须贯穿到治国理政的方方面面。",
    options: {
      A: "全面的",
      B: "系统的",
      C: "整体的",
      D: "局部的"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 98,
    chapter: 3,
    type: "多选题",
    question: "健全党的全面领导制度，必须（ ）。",
    options: {
      A: "完善党在各种组织中发挥领导作用的制度",
      B: "完善党协调各方的机制",
      C: "完善党领导各项事业的具体制度",
      D: "完善人民代表大会制度"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 99,
    chapter: 3,
    type: "多选题",
    question: "中国共产党是最高政治领导力量，这是由我国（ ）和（ ）所决定的。",
    options: {
      A: "国家性质",
      B: "政治制度体系",
      C: "经济基础",
      D: "经济制度"
    },
    answer: ["A", "B"]
  },
  {
    id: 100,
    chapter: 3,
    type: "多选题",
    question: "坚持和加强党的全面领导，使党的（ ）显著增强。",
    options: {
      A: "政治领导力",
      B: "思想引领力",
      C: "群众组织力",
      D: "社会号召力"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 101,
    chapter: 3,
    type: "多选题",
    question: "党的领导是全面的，体现在（ ）。",
    options: {
      A: "领导对象全面",
      B: "领导内容全面",
      C: "领导过程全面",
      D: "领导方式全面"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 102,
    chapter: 3,
    type: "判断题",
    question: "历史和现实都证明，中国人民和中华民族之所以能够扭转近代以后的历史命运、取得今天的伟大成就，最根本的是有中国共产党的坚强领导。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 103,
    chapter: 3,
    type: "判断题",
    question: "中国共产党作为最高政治领导力量是自封的。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 104,
    chapter: 3,
    type: "判断题",
    question: "事在四方，要在中央。党中央集中统一领导是党的领导的最高原则，是党保持团结统一和强大战斗力、不断取得胜利的关键所在。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 105,
    chapter: 3,
    type: "判断题",
    question: "维护党中央权威和集中统一领导，同坚持党的民主集中制是完全一致的。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 106,
    chapter: 3,
    type: "判断题",
    question: "中国共产党作为最高政治领导力量是由中华民族伟大复兴事业决定的。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 107,
    chapter: 4,
    type: "单选题",
    question: "（    ）是党执政的最大底气，也是党执政最深厚的根基。",
    options: {
      A: "人民",
      B: "实现共产主义理想",
      C: "有丰富经验",
      D: "物质基础雄厚"
    },
    answer: "A"
  },
  {
    id: 108,
    chapter: 4,
    type: "单选题",
    question: "（    ）始终是党的生命线和根本工作路线，是我们党永葆青春活力和战斗力的重要传家宝。",
    options: {
      A: "政治路线",
      B: "经济路线",
      C: "群众路线",
      D: "组织路线"
    },
    answer: "C"
  },
  {
    id: 109,
    chapter: 4,
    type: "单选题",
    question: "党执政后的最大危险是（    ）。",
    options: {
      A: "消极腐败",
      B: "脱离群众",
      C: "改革出现问题",
      D: "没有坚持公有制的主体地位"
    },
    answer: "B"
  },
  {
    id: 110,
    chapter: 4,
    type: "单选题",
    question: "（     ）是社会主义的本质要求，是中国式现代化的重要特征。",
    options: {
      A: "共同富裕",
      B: "社会和谐稳定",
      C: "人民主体地位",
      D: "解决社会主要矛盾"
    },
    answer: "A"
  },
  {
    id: 111,
    chapter: 4,
    type: "单选题",
    question: "我们党的最大政治优势是（    ）。",
    options: {
      A: "党领导一切",
      B: "密切联系群众",
      C: "走中国特色社会主义道路",
      D: "人多力量大"
    },
    answer: "B"
  },
  {
    id: 112,
    chapter: 4,
    type: "单选题",
    question: "（    ）是新时代坚持和发展中国特色社会主义的根本立场，是贯穿党治国理政全部活动的一条红线。",
    options: {
      A: "坚持以人民为中心",
      B: "把马克思主义基本原理与中国实际相结合",
      C: "坚持和发展中国特色社会主义",
      D: "“五位一体”总体布局"
    },
    answer: "A"
  },
  {
    id: 113,
    chapter: 4,
    type: "单选题",
    question: "（    ）是党的工作的最高裁决者和最终评判者。",
    options: {
      A: "实践",
      B: "人民",
      C: "党中央",
      D: "国务院"
    },
    answer: "B"
  },
  {
    id: 114,
    chapter: 4,
    type: "单选题",
    question: "（    ）是获得真知灼见的源头活水，是贯彻群众路线的有效途径。",
    options: {
      A: "构建新发展格局",
      B: "以人民为中心",
      C: "把人民对美好生活作为奋斗目标",
      D: "调查研究"
    },
    answer: "D"
  },
  {
    id: 115,
    chapter: 4,
    type: "单选题",
    question: "习近平总书记指出：“时代是出卷人，我们是答卷人，（   ）是阅卷人。”",
    options: {
      A: "人民",
      B: "公民",
      C: "新时代青年",
      D: "中国共产党"
    },
    answer: "A"
  },
  {
    id: 116,
    chapter: 4,
    type: "单选题",
    question: "中国共产党的根本政治立场是（    ），它是我们党区别于其他政党的显著标志。",
    options: {
      A: "人民立场",
      B: "党的全面领导",
      C: "共同富裕",
      D: "社会主义立场"
    },
    answer: "A"
  },
  {
    id: 117,
    chapter: 4,
    type: "多选题",
    question: "依靠人民创造历史伟业，就要做到（    ）。",
    options: {
      A: "尊重人民主体地位",
      B: "尊重人民首创精神",
      C: "激发人民群众的创新创造活力",
      D: "总结、概括人民群众实践中形成的新鲜经验"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 118,
    chapter: 4,
    type: "多选题",
    question: "领导干部树立和践行正确的政绩观，要做到（   ）。",
    options: {
      A: "以人民满意不满意作为检验工作的最终评判标准",
      B: "把为老百姓办了多少好事实事作为检验政绩的重要标准",
      C: "以国内生产总值增长率论英雄",
      D: "大搞劳民伤财的形象工程和政绩工程"
    },
    answer: ["A", "B"]
  },
  {
    id: 119,
    chapter: 4,
    type: "多选题",
    question: "（  ）与（  ）相统一，既是马克思主义的价值追求，也是社会主义的本质要求，更是中国共产党人的奋斗目标。",
    options: {
      A: "促进人的全面发展",
      B: "促进社会稳定",
      C: "促进共同富裕",
      D: "促进经济发展"
    },
    answer: ["A", "C"]
  },
  {
    id: 120,
    chapter: 4,
    type: "多选题",
    question: "坚持以人民为中心的发展思想，就要在高质量发展中促进共同富裕，做到（   ）。",
    options: {
      A: "发展为了人民",
      B: "发展幸福人民",
      C: "发展依靠人民",
      D: "发展成果由人民共享"
    },
    answer: ["A", "C", "D"]
  },
  {
    id: 121,
    chapter: 4,
    type: "多选题",
    question: "以人民为中心的发展思想，不是高高在上的宣传口号，绝对不能只停留在口头上，要全方位贯穿于经济社会发展的各个环节，体现在人民群众（   ）的扎实提升上。",
    options: {
      A: "使命感",
      B: "获得感",
      C: "幸福感",
      D: "安全感"
    },
    answer: ["B", "C", "D"]
  },
  {
    id: 122,
    chapter: 4,
    type: "判断题",
    question: "人民是历史的创造者，是决定党和国家前途命运的根本力量。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 123,
    chapter: 4,
    type: "判断题",
    question: "组织路线始终是党的生命线和根本工作路线，是我们党永葆青春活力和战斗力的重要传家宝。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 124,
    chapter: 4,
    type: "判断题",
    question: "坚持以人民为中心的发展思想，根本目的是不断增进人民福祉、促进人的全面发展。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 125,
    chapter: 4,
    type: "判断题",
    question: "批评和自我批评是我们党具有的独特优势和显著标志。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 126,
    chapter: 4,
    type: "判断题",
    question: "群众路线是我们党始终坚持的根本工作方法。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 127,
    chapter: 5,
    type: "单选题",
    question: "2013年11月，党的（  ）通过了《中共中央关于全面深化改革若干重大问题的决定》，对全面深化改革进行总体擎画。",
    options: {
      A: "十八届三中全会",
      B: "十八大",
      C: "十八届五中全会",
      D: "十七届三中全会"
    },
    answer: "A"
  },
  {
    id: 128,
    chapter: 5,
    type: "单选题",
    question: "治理国家，（    ）是起根本性、全局性、长远性作用的。",
    options: {
      A: "制度",
      B: "能力",
      C: "方法",
      D: "理论"
    },
    answer: "A"
  },
  {
    id: 129,
    chapter: 5,
    type: "单选题",
    question: "习近平总书记用“好吃的肉都吃掉了，剩下的都是难啃的硬骨头”来比喻（    ）。",
    options: {
      A: "全面深化改革",
      B: "新民主主义革命",
      C: "建立中国共产党",
      D: "全面建成社会主义现代化强国"
    },
    answer: "A"
  },
  {
    id: 130,
    chapter: 5,
    type: "单选题",
    question: "改革是中国的第二次革命，改革是（    ）。",
    options: {
      A: "一个阶级推翻另一个阶级的革命",
      B: "社会主义制度的自我完善和发展",
      C: "原有经济体制的细枝末节的修补",
      D: "否定和抛弃社会主义基本制度"
    },
    answer: "B"
  },
  {
    id: 131,
    chapter: 5,
    type: "单选题",
    question: "实践证明，（    ）是决定当代中国命运的关键一招，也是决定实现“两个一百年”奋斗目标、实现中华民族伟大复兴的关键一招。",
    options: {
      A: "改革开放",
      B: "经济体制改革",
      C: "农村改革",
      D: "对外开放",
    },
    answer: "A"
  },
  {
    id: 132,
    chapter: 5,
    type: "单选题",
    question: "中国特色社会主义制度和国家治理体系是以（    ）为指导、植根中国大地、具有深厚中华文化根基、深得人民拥护的制度和治理体系。",
    options: {
      A: "马克思主义",
      B: "社会主义",
      C: "中国特色社会主义",
      D: "毛泽东思想"
    },
    answer: "A"
  },
  {
    id: 133,
    chapter: 5,
    type: "单选题",
    question: "（    ）是改革开放的鲜明特征和首要任务。",
    options: {
      A: "解放和发展社会生产力",
      B: "解放思想",
      C: "解放和增强社会活力",
      D: "构建新发展格局"
    },
    answer: "A"
  },
  {
    id: 134,
    chapter: 5,
    type: "单选题",
    question: "推进高水平对外开放，依托我国超大规模市场优势，以（   ）吸引全球资源要素，增强国内国际两个市场两种资源联动效应，提升贸易投资合作质量和水平。",
    options: {
      A: "国内大循环",
      B: "内需战略",
      C: "现代化经济体系",
      D: "供给侧结构性改革"
    },
    answer: "A"
  },
  {
    id: 135,
    chapter: 5,
    type: "单选题",
    question: "近年来，我国对世界经济增长贡献率超过（    ）%。",
    options: {
      A: "30",
      B: "20",
      C: "40",
      D: "50"
    },
    answer: "A"
  },
  {
    id: 136,
    chapter: 5,
    type: "单选题",
    question: "党的十九大提出，到（   ）年，各方面制度更加完善，国家治理体系和治理能力能力现代化基本实现；到本世纪中叶，实现国家治理体系和治理能力现代化。",
    options: {
      A: "2035",
      B: "2025",
      C: "2030",
      D: "2040"
    },
    answer: "A"
  },
  {
    id: 137,
    chapter: 5,
    type: "多选题",
    question: "改革开放是有方向、有立场、有原则的。全面深化改革必须始牢牢把握正确方向，必须（    ），确保改革不改向、变革不变色。",
    options: {
      A: "坚持和改善党的全面领导",
      B: "坚持和完善中国特色社会主义制度",
      C: "坚持以人民为中心",
      D: "有利于进一步解放思想、解放和发展社会生产力、解放和增强社会活力"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 138,
    chapter: 5,
    type: "多选题",
    question: "全面深化改革的总目标是（     ）。",
    options: {
      A: "完善和发展中国特色社会主义制度",
      B: "推进国家治理体系和治理能力现代化",
      C: "实现“两个一百年”奋斗目标",
      D: "实现中国梦"
    },
    answer: ["A", "B"]
  },
  {
    id: 139,
    chapter: 5,
    type: "多选题",
    question: "我国推进高水平对外开放的重点举措包括（    ）。",
    options: {
      A: "加快建设贸易强国",
      B: "推动共建“一带一路”高质量发展",
      C: "实施自由贸易试验区提升战略",
      D: "深度参与全球产业分工和合作"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 140,
    chapter: 5,
    type: "多选题",
    question: "我们统筹国内国际两个大局，坚持对外开放的基本国策，实行积极主动的开放政策，形成（    ）的全面开放新格局，为我国创造了良好国际环境、开拓了广阔发展空间。",
    options: {
      A: "全方位",
      B: "多层次",
      C: "宽领域",
      D: "深把握"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 141,
    chapter: 5,
    type: "多选题",
    question: "改革开放是我们党的一次伟大觉醒，正是这个伟大觉醒孕育了我们党从理论到实践的伟大创造，极大改变了中国的面貌、中华民族的面貌、中国人民的面貌、中国共产党的面貌。历史和实践证明，改革开放是（    ）。",
    options: {
      A: "党和人民大踏步赶上时代的重要法宝",
      B: "决定当代中国命运的关键一招",
      C: "中国区别于西方国家的显著标志",
      D: "坚持和发展中国特色社会主义的必由之路"
    },
    answer: ["A", "B", "D"]
  },
  {
    id: 142,
    chapter: 5,
    type: "判断题",
    question: "制度优势是一个国家最大的优势。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 143,
    chapter: 5,
    type: "判断题",
    question: "党的十八大是划时代的，实现改革开放由局部探索、破冰突围到系统集成、全面深化改革的转变，开创了我国改革开放新局面。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 144,
    chapter: 5,
    type: "判断题",
    question: "国家治理体系和治理能力是一个国家制度和制度执行能力的集中体现。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 145,
    chapter: 5,
    type: "判断题",
    question: "完善和发展中国特色社会主义制度，规定了改革的根本方向。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 146,
    chapter: 5,
    type: "判断题",
    question: "发展是解决一切经济社会问题的关键。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 147,
    chapter: 6,
    type: "单选题",
    question: "党的十八大以来，我国经济已由高速增长阶段转向（）阶段。",
    options: {
      A: "世界级市场",
      B: "高水平开放",
      C: "强动力转换",
      D: "高质量发展"
    },
    answer: "D"
  },
  {
    id: 148,
    chapter: 6,
    type: "单选题",
    question: "（）是引领发展的第一动力。",
    options: {
      A: "劳动力",
      B: "资本",
      C: "科技",
      D: "创新"
    },
    answer: "D"
  },
  {
    id: 149,
    chapter: 6,
    type: "单选题",
    question: "构建高水平社会主义市场经济体制，关键是要（ ）。",
    options: {
      A: "处理好政府和市场的关系",
      B: "处理好当前利益和长远利益的关系",
      C: "处理好中国和外国的关系",
      D: "处理好效率和公平的关系"
    },
    answer: "A"
  },
  {
    id: 150,
    chapter: 6,
    type: "单选题",
    question: "我们乘势而上开启全面建设社会主义现代化国家新征程、向第二个百年奋斗目标进军，这标志着我国进入了一个（  ）。",
    options: {
      A: "新发展时期",
      B: "新发展方位",
      C: "新发展阶段",
      D: "新发展格局"
    },
    answer: "C"
  },
  {
    id: 151,
    chapter: 6,
    type: "单选题",
    question: "（  ）是发展行动的先导。",
    options: {
      A: "发展理念",
      B: "发展格局",
      C: "发展方向",
      D: "发展策略"
    },
    answer: "A"
  },
  {
    id: 152,
    chapter: 6,
    type: "单选题",
    question: "（  ）的发展理念，相互贯通、相互促进，是具有内在联系的集合体，要统一贯彻，不能顾此失彼，也不能相互替代。",
    options: {
      A: "改革、和谐、绿色、开放、共享",
      B: "创新、协调、和谐、开放、共赢",
      C: "创新、和谐、绿色、开放、发展",
      D: "创新、协调、绿色、开放、共享"
    },
    answer: "D"
  },
  {
    id: 153,
    chapter: 6,
    type: "单选题",
    question: "现代化经济体系必须坚持质量第一、（   ）优先。",
    options: {
      A: "人才",
      B: "速度",
      C: "效率",
      D: "效益"
    },
    answer: "D"
  },
  {
    id: 154,
    chapter: 6,
    type: "单选题",
    question: "下列不属于社会主义基本经济制度的是（  ）。",
    options: {
      A: "公有制为主体、多种所有制经济共同发展",
      B: "按劳分配为主体、多种分配方式并存",
      C: "社会主义市场经济体制",
      D: "人民代表大会制度"
    },
    answer: "D"
  },
  {
    id: 155,
    chapter: 6,
    type: "单选题",
    question: "构建以（     ）为主体、（     ）相互促进的新发展格局，是推动高质量发展的战略基点，是关系我国发展全局的重大战略任务。",
    options: {
      A: "国内大循环；国内国际双循环",
      B: "国际循环；国内循坏",
      C: "国际大循环；国内国际双循环",
      D: "国内国际双循环；国内大循环；"
    },
    answer: "A"
  },
  {
    id: 156,
    chapter: 6,
    type: "多选题",
    question: "新发展阶段是（ ）。",
    options: {
      A: "我国社会主义初级阶段历史进程中的一个重要阶段",
      B: "中国共产党带领人民迎来从站起来、富起来到强起来历史性跨越的新阶段",
      C: "全面建设社会主义现代化国家、向第二个百年奋斗目标进军的重要阶段。",
      D: "决胜全面小康社会的阶段"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 157,
    chapter: 6,
    type: "多选题",
    question: "高质量发展的重大战略意义是（  ）。",
    options: {
      A: "高质量发展为全面建设社会主义现代化国家提供更为坚实的物质基础。",
      B: "高质量发展是不断满足人民对美好生活需要的重要保证",
      C: "高质量发展是维护国家长治久安的必然要求"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 158,
    chapter: 6,
    type: "多选题",
    question: "新发展理念具有丰富的科学内涵和具体的实践要求是（ ）。",
    options: {
      A: "创新是引领发展的第一动力，创新发展注重的是解决发展动力问题",
      B: "协调是持续健康发展的内在要求，协调发展注重的是解决发展不平衡问题",
      C: "绿色是永续发展的必要条件和人民对美好生活追求的重要体现，绿色发展注重的是解决人与自然和谐共生问题",
      D: "开放是国家繁荣发展的必由之路，开放发展注重的是解决发展内外联动问题",
      E: "共享是中国特色社会主义的本质要求，共享发展注重的是解决社会公平正义问题"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 159,
    chapter: 6,
    type: "多选题",
    question: "公有制经济包括（  ）。",
    options: {
      A: "国有经济",
      B: "集体经济",
      C: "混合所有制经济中的国有成分",
      D: "混合所有制经济中的集体成分"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 160,
    chapter: 6,
    type: "判断题",
    question: "经济发展是一个螺旋式上升的过程，上升不是线性的，量积累到一定阶段，必须转向质的提升，我国经济发展也要遵循这一规律。（    ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 161,
    chapter: 6,
    type: "判断题",
    question: "我国将立足新发展阶段，贯穿新发展理念，积极构建以国际大循环为主体、国内国际双循环相互促进的新发展格局。（    ）",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 162,
    chapter: 6,
    type: "判断题",
    question: "建设现代化经济体系是我国发展的战略目标，是推动高质量发展、全面提高经济整体竞争力的必然要求。（    ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 163,
    chapter: 6,
    type: "判断题",
    question: "全面建设社会主义现代化国家，最艰巨最繁重的任务依然在农村，最广泛最深厚的基础依然在农村。（     ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 164,
    chapter: 7,
    type: "单选题",
    question: "必须坚持(   )是第一生产力。",
    options: {
      A: "科技",
      B: "人才",
      C: "资源",
      D: "环境"
    },
    answer: "A"
  },
  {
    id: 165,
    chapter: 7,
    type: "单选题",
    question: "(   )是发展第一动力。",
    options: {
      A: "创新",
      B: "科技",
      C: "人才",
      D: "党的领导"
    },
    answer: "A"
  },
  {
    id: 166,
    chapter: 7,
    type: "单选题",
    question: "(   )提出“科学技术是第一生产力”。",
    options: {
      A: "邓小平",
      B: "毛泽东",
      C: "习近平",
      D: "胡锦涛"
    },
    answer: "A"
  },
  {
    id: 167,
    chapter: 7,
    type: "单选题",
    question: "科教兴国是我国的(   )。",
    options: {
      A: "基本国策",
      B: "基本政策",
      C: "基本路线",
      D: "基本战略"
    },
    answer: "A"
  },
  {
    id: 168,
    chapter: 7,
    type: "单选题",
    question: "(   )是民族振兴、社会进步的基石。",
    options: {
      A: "教育",
      B: "科技",
      C: "人才",
      D: "共同富裕"
    },
    answer: "A"
  },
  {
    id: 169,
    chapter: 7,
    type: "单选题",
    question: "(   )是发展教育的根本尺度。",
    options: {
      A: "人民满意",
      B: "科技突破",
      C: "实现共同富裕",
      D: "发展生产力"
    },
    answer: "A"
  },
  {
    id: 170,
    chapter: 7,
    type: "单选题",
    question: "(   )是国家强盛之基、安全之要。",
    options: {
      A: "科技自立自强",
      B: "人才引进",
      C: "共同富裕",
      D: "改革开放"
    },
    answer: "A"
  },
  {
    id: 171,
    chapter: 7,
    type: "单选题",
    question: "(   )是我们攀登世界科技高峰的必由之路。",
    options: {
      A: "自主创新",
      B: "脱贫攻坚",
      C: "守正创新",
      D: "信息技术"
    },
    answer: "A"
  },
  {
    id: 172,
    chapter: 7,
    type: "单选题",
    question: "必须坚持教育优先发展，把(   )作为教育的根本任务，办好人民满意的教育。",
    options: {
      A: "立德树人",
      B: "社会实践",
      C: "创新拔尖",
      D: "专业技术"
    },
    answer: "A"
  },
  {
    id: 173,
    chapter: 7,
    type: "单选题",
    question: "教育、科技、人才是全面建设社会主义现代化国家的(   )支撑。",
    options: {
      A: "基础性、战略性",
      B: "基础性",
      C: "战略性",
      D: "可持续"
    },
    answer: "A"
  },
  {
    id: 174,
    chapter: 7,
    type: "单选题",
    question: "人才强国战略，就是要牢固树立人才资源是(   )的理念。",
    options: {
      A: "第一资源",
      B: "第一动力",
      C: "第一生产力",
      D: "引领力"
    },
    answer: "A"
  },
  {
    id: 175,
    chapter: 7,
    type: "单选题",
    question: "创新驱动发展战略，就是要坚持创新是(   )，把创新驱动落实到现代化建设整个进程和各个方面。",
    options: {
      A: "第一动力",
      B: "第一资源",
      C: "第一生产力",
      D: "引领力"
    },
    answer: "A"
  },
  {
    id: 176,
    chapter: 7,
    type: "单选题",
    question: "(   )是国之大计、党之大计。",
    options: {
      A: "教育",
      B: "科技",
      C: "人才",
      D: "创新"
    },
    answer: "A"
  },
  {
    id: 177,
    chapter: 7,
    type: "单选题",
    question: "(   )是国之利器，要加快实现高水平科技自立自强。",
    options: {
      A: "科技",
      B: "教育",
      C: "人才",
      D: "创新"
    },
    answer: "A"
  },
  {
    id: 178,
    chapter: 7,
    type: "单选题",
    question: "(   )是实现民族振兴、赢得国际竞争主动的战略资源。",
    options: {
      A: "人才",
      B: "教育",
      C: "科技",
      D: "创新"
    },
    answer: "A"
  },
  {
    id: 179,
    chapter: 7,
    type: "单选题",
    question: "(   )是科技创新的源头。",
    options: {
      A: "基础研究",
      B: "应用研究",
      C: "自主创新",
      D: "原始创新"
    },
    answer: "A"
  },
  {
    id: 180,
    chapter: 7,
    type: "单选题",
    question: "(   )是世界科技强国竞争的着力点。",
    options: {
      A: "国家战略科技力量",
      B: "国家实验室",
      C: "国家科研机构",
      D: "高水平研究型大学"
    },
    answer: "A"
  },
  {
    id: 181,
    chapter: 7,
    type: "单选题",
    question: "要把(   )作为龙头，把加快建设中国特色、世界一流的大学和优势学科作为重中之重，大力加强基础学科、新兴学科、交叉学科建设。",
    options: {
      A: "高等教育",
      B: "基础教育",
      C: "职业教育",
      D: "继续教育"
    },
    answer: "A"
  },
  {
    id: 182,
    chapter: 7,
    type: "多选题",
    question: "全面建设社会主义现代化国家,(   )。",
    options: {
      A: "教育是根本",
      B: "科技是关键",
      C: "人才是基础",
      D: "改革是保证"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 183,
    chapter: 7,
    type: "多选题",
    question: "实施（  ）是增强综合国力、满足人民群众美好生活需要的必然要求，是建设教育强国、科技强国、人才强国的重大举措",
    options: {
      A: "科教兴国战略",
      B: "人才强国战略",
      C: "创新驱动发展战略",
      D: "“四个全面战略”"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 184,
    chapter: 7,
    type: "多选题",
    question: "实施科教兴国战略，（   ）。",
    options: {
      A: "是应对新时代环境变化的必然要求",
      B: "是建设创新型国家的必然要求",
      C: "是应对国际竞争的有力举措",
      D: "是决胜全面小康社会的重大部署"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 185,
    chapter: 7,
    type: "多选题",
    question: "实施人才强国战略，（  ），实施更加积极、更加开放、更加有效的人才政策。",
    options: {
      A: "要坚持党管人才原则",
      B: "坚持尊重劳动、尊重知识、尊重人才、尊重创造",
      C: "完善人才战略布局",
      D: "深化人才发展体制机制改革"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 186,
    chapter: 7,
    type: "多选题",
    question: "实施创新驱动发展战略，（   ），让创新成为全社会的共同行动。",
    options: {
      A: "要坚持面向世界科技前沿、面向经济主战场",
      B: "要坚持面向国家重大需求、面向人民生命健康",
      C: "坚持科技创新，增强自主创新能力",
      D: "坚决打赢关键核心技术攻坚战"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 187,
    chapter: 7,
    type: "多选题",
    question: "教育优先发展，要做到（  ），使我国教育越办越好。",
    options: {
      A: "经济社会发展规划优先安排教育发展",
      B: "财政资金投入优先保障教育投入",
      C: "公共资源配置优先满足教育和人力资源开发需要",
      D: "推动健全优先发展教育事业的体制机制"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 188,
    chapter: 7,
    type: "多选题",
    question: "必须坚持教育（    ）。",
    options: {
      A: "为人民服务",
      B: "为中国共产党治国理政服务",
      C: "为巩固和发展中国特色社会主义制度服务",
      D: "为改革开放和社会主义现代化建设服务"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 189,
    chapter: 7,
    type: "多选题",
    question: "落实立德树人根本任务，必须着力解决好（  ）的问题，这是教育的根本问题。",
    options: {
      A: "培养什么人",
      B: "怎样培养人",
      C: "为谁培养人",
      D: "建设教育强国"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 190,
    chapter: 7,
    type: "多选题",
    question: "我们培养的人，（   ）。",
    options: {
      A: "要坚定共产主义远大理想和中国特色社会主义共同理想",
      B: "要有高尚的道德品质，厚植爱国主义情怀",
      C: "要养成刻苦学习的习惯",
      D: "要积极投身社会实践，增长经验和技能"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 191,
    chapter: 7,
    type: "判断题",
    question: "实现高水平科技自立自强是国家强盛和民族复兴的战略基石。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 192,
    chapter: 7,
    type: "判断题",
    question: "科技创新是百年未有之大变局中的一个关键变量，世界主要国家纷纷把科技创新作为国际战略博弈的主要战场。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 193,
    chapter: 7,
    type: "判断题",
    question: "把教育技术掌握在自己手中，才能真正掌握竞争和发展的主动权。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 194,
    chapter: 7,
    type: "判断题",
    question: "培养人才是国家和民族长远发展大计。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 195,
    chapter: 7,
    type: "判断题",
    question: "坚持党对人才工作的全面领导,这是做好人才工作的根本保证。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 196,
    chapter: 7,
    type: "判断题",
    question: "人才是国之大计、党之大计，是国家经济社会发展的支撑力量，在国家发展中始终具有基础性先导性全局性地位。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 197,
    chapter: 7,
    type: "判断题",
    question: "科技是国之利器。要加快实现高水平科技自立自强。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 198,
    chapter: 7,
    type: "判断题",
    question: "人才是实现民族振兴、赢得国际竞争主动的战略资源。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 199,
    chapter: 8,
    type: "单选题",
    question: "（）是社会主义民主政治的本质属性。",
    options: {
      A: "全过程人民民主",
      B: "全面依法治国",
      C: "建设社会主义法治国家",
      D: "建设社会主义法治体系"
    },
    answer: "A"
  },
  {
    id: 200,
    chapter: 8,
    type: "单选题",
    question: "（）是一个政党、一个国家的最大优势。",
    options: {
      A: "政党优势",
      B: "制度优势",
      C: "治理优势",
      D: "理论优势"
    },
    answer: "B"
  },
  {
    id: 201,
    chapter: 8,
    type: "单选题",
    question: "（）建立在社会主义经济基础之上，体现了社会主义国家的性质，反映了社会主义制度的本质要求，是一种新型的社会主义民主。",
    options: {
      A: "法治国家",
      B: "法治社会",
      C: "人民民主",
      D: "依法治国"
    },
    answer: "C"
  },
  {
    id: 202,
    chapter: 8,
    type: "单选题",
    question: "把（）作为党的民族工作主线，民族团结进步呈现新气象。",
    options: {
      A: "民族平等",
      B: "民族团结",
      C: "民族和谐",
      D: "铸牢中华民族共同体意识"
    },
    answer: "D"
  },
  {
    id: 203,
    chapter: 8,
    type: "单选题",
    question: "走中国特色社会主义政治发展道路，最根本的是坚持（）。",
    options: {
      A: "马克思主义",
      B: "依法治国",
      C: "人民当家作主",
      D: "党的领导"
    },
    answer: "D"
  },
  {
    id: 204,
    chapter: 8,
    type: "单选题",
    question: "（）是我国的根本政治制度，是符合我国国情和实际、体现社会主义国家性质、保证人民当家作主、保障实现中华民族伟大复兴的好制度，是我们党领导人民在人类政治制度史上的伟大创造。",
    options: {
      A: "人民代表大会制度",
      B: "多党合作和政治协商制度",
      C: "民族区域自治制度",
      D: "基层群众自治制度"
    },
    answer: "A"
  },
  {
    id: 205,
    chapter: 8,
    type: "单选题",
    question: "（）是社会主义民主政治建设的基础。",
    options: {
      A: "人民代表大会制度",
      B: "多党合作和政治协商制度",
      C: "民族区域自治制度",
      D: "基层群众自治制度"
    },
    answer: "D"
  },
  {
    id: 206,
    chapter: 8,
    type: "单选题",
    question: "习近平指出：“有事好商量，众人的事情由众人商量，（ ）是人民民主的真谛。”",
    options: {
      A: "完善协商民主体系",
      B: "健全协商制度平台",
      C: "找到全社会意愿和要求的最大公约数",
      D: "坚持党的领导、统一战线、协商民主有机结合"
    },
    answer: "C"
  },
  {
    id: 207,
    chapter: 8,
    type: "单选题",
    question: "统战工作的本质要求是（），解决的就是人心和力量的问题。",
    options: {
      A: "民族平等",
      B: "协商民主",
      C: "大团结大联合",
      D: "铸牢中华民族共同体意识"
    },
    answer: "C"
  },
  {
    id: 208,
    chapter: 8,
    type: "单选题",
    question: "统战工作的关键是要坚持（），发扬“团结–批评–团结”的优良传统，在尊重多样性中寻求一致性，找到最大公约数、画出最大同心圆。",
    options: {
      A: "协商民主",
      B: "求同存异",
      C: "平等团结",
      D: "求真务实"
    },
    answer: "B"
  },
  {
    id: 209,
    chapter: 8,
    type: "单选题",
    question: "（）是我国各族人民的生命线，中华民族共同体意识是民族团结之本。多民族是我国的一大特色，也是我国各族人民血脉相融、命运与共的根本保证。",
    options: {
      A: "民族平等",
      B: "民族团结",
      C: "民族和谐",
      D: "民族依存"
    },
    answer: "B"
  },
  {
    id: 210,
    chapter: 8,
    type: "单选题",
    question: "（）是中国共产党和中国人民最显著的精神标识，能团结奋斗的民族才有前途，能团结奋斗的政党才能立于不败之地。",
    options: {
      A: "爱国主义",
      B: "团结奋斗",
      C: "自强不息",
      D: "勤劳勇敢"
    },
    answer: "B"
  },
  {
    id: 211,
    chapter: 8,
    type: "单选题",
    question: "（）是中华民族精神的核心，维系着华夏大地上各个民族的团结统一，激励着一代又一代中华儿女为祖国奉献亿万热血。",
    options: {
      A: "爱国主义",
      B: "团结奋斗",
      C: "自强不息",
      D: "勤劳勇敢"
    },
    answer: "A"
  },
  {
    id: 212,
    chapter: 8,
    type: "单选题",
    question: "（）是统一战线最鲜明的特征，是统一战线最核心最根本的问题。",
    options: {
      A: "爱国统一",
      B: "党的领导",
      C: "团结奋斗",
      D: "民主协商"
    },
    answer: "B"
  },
  {
    id: 213,
    chapter: 8,
    type: "单选题",
    question: "全过程人民民主始终将（）作为民主政治建设的出发点和落脚点。党和国家始终把人民利益作为基本政治考量和根本政治准则，在决策、执行、监督、落实各个环节都要倾听来自人民的声音，汇聚人民的智慧，使社会主义民主政治的成果惠及广大人民。",
    options: {
      A: "民生福祉",
      B: "为中国人民谋幸福",
      C: "全心全意为人民服务",
      D: "实现最广大人民根本利益"
    },
    answer: "D"
  },
  {
    id: 214,
    chapter: 8,
    type: "多选题",
    question: "中国特色社会主义政治制度是由（）等组成的制度体系。",
    options: {
      A: "根本政治制度",
      B: "基本政治制度",
      C: "基层政治制度",
      D: "重要政治制度"
    },
    answer: ["A", "B", "D"]
  },
  {
    id: 215,
    chapter: 8,
    type: "多选题",
    question: "人民代表大会制度是坚持（）有机统一的根本政治制度安排。",
    options: {
      A: "党的领导",
      B: "人民当家作主",
      C: "人民民主",
      D: "依法治国"
    },
    answer: ["A", "B", "D"]
  },
  {
    id: 216,
    chapter: 8,
    type: "多选题",
    question: "中国共产党领导的（）构成我国的基本政治制度。",
    options: {
      A: "人民代表大会制度",
      B: "多党合作和政治协商制度",
      C: "民族区域自治制度",
      D: "基层群众自治制度"
    },
    answer: ["B", "C", "D"]
  },
  {
    id: 217,
    chapter: 8,
    type: "多选题",
    question: "全过程人民民主，是（）的民主。",
    options: {
      A: "最广泛",
      B: "最真实",
      C: "最有效",
      D: "最管用"
    },
    answer: ["A", "B", "D"]
  },
  {
    id: 218,
    chapter: 8,
    type: "多选题",
    question: "全过程人民民主的提出、实践和发展，鲜明展示了我们党始终高举人民民主旗帜、实现人民当家作主的坚定立场，深刻彰显了我国人民民主的鲜明特色和显著优势，实现了（）相统一。",
    options: {
      A: "过程民主和成果民主",
      B: "程序民主和实质民主",
      C: "直接民主和间接民主",
      D: "人民民主和国家意志"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 422,
    chapter: 8,
    type: "多选题",
    question: "中国共产党与各民主党派长期共存、互相监督、肝胆相照、荣辱与共，形成（）这一具有鲜明中国特色的新型政党制度。",
    options: {
      A: "共产党领导",
      B: "多党派合作",
      C: "共产党执政",
      D: "多党派参政"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 423,
    chapter: 8,
    type: "多选题",
    question: "加强和促进海内外中华儿女大团结，要辩证把握好（）方面关系。这些关系既讲\"两点论\"又讲\"重点论\"，为把握统一战线的政治性和策略性、推动统战工作高质量发展提供了重要原则和方法。",
    options: {
      A: "固守圆心和扩大共识的关系",
      B: "潜绩和显绩的关系",
      C: "原则性和灵活性的关系",
      D: "团结和斗争的关系"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 219,
    chapter: 8,
    type: "判断题",
    question: "坚定中国特色社会主义制度自信，首先要坚定对中国特色社会主义经济制度的自信，增强走中国特色社会主义政治发展道路的信心和决心。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 220,
    chapter: 8,
    type: "判断题",
    question: "平等是全人类共同价值，是人类政治文明发展的成果。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 221,
    chapter: 8,
    type: "判断题",
    question: "走中国特色社会主义政治发展道路，必须坚持党的领导、人民当家作主、依法治国有机统一。党的领导是人民当家作主和依法治国的根本保证，依法治国是社会主义民主政治的本质特征，人民当家作主是党领导人民治理国家的基本方式，三者统一于我国社会主义民主政治伟大实践。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 222,
    chapter: 8,
    type: "判断题",
    question: "我国的各项国家制度都是围绕人民当家作主构建的，国家治理体系都是围绕实现人民当家作主运转的。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 223,
    chapter: 8,
    type: "判断题",
    question: "协商民主是中国社会主义民主政治中独特的、独有的、独到的民主形式。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 224,
    chapter: 8,
    type: "判断题",
    question: "统一战线是中国共产党夺取革命、建设、改革事业胜利的重要法宝，也是实现中华民族伟大复兴的重要法宝。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 225,
    chapter: 9,
    type: "单选题",
    question: "( ）是社会主义法治最根本的保证。",
    options: {
      A: "党的领导",
      B: "中国特色社会主义制度",
      C: "全面深化改革",
      D: "严密的法治监督体系"
    },
    answer: "A"
  },
  {
    id: 226,
    chapter: 9,
    type: "单选题",
    question: "法治监督体系以（      ）为重点。",
    options: {
      A: "规范和约束公权力运行",
      B: "思想教育",
      C: "制度建设",
      D: "少数领导干部"
    },
    answer: "A"
  },
  {
    id: 227,
    chapter: 9,
    type: "单选题",
    question: "全面依法治国最广泛、最深厚的基础是（   ）。",
    options: {
      A: "人民",
      B: "中国共产党",
      C: "社会主义民主",
      D: "社会稳定"
    },
    answer: "A"
  },
  {
    id: 228,
    chapter: 9,
    type: "单选题",
    question: "1997年，（   ）确立依法治国为治理国家的基本方略，把建设社会主义法治国家，确定为社会主义现代化建设的重要目标。",
    options: {
      A: "十五大",
      B: "十四大",
      C: "十三届四中全会",
      D: "十三大"
    },
    answer: "A"
  },
  {
    id: 229,
    chapter: 9,
    type: "单选题",
    question: "（   ）既是全面从严治党的重要依据，也是全面依法治国的有力保障。",
    options: {
      A: "党内法规",
      B: "党章",
      C: "党的纪律条例",
      D: "党的监督机制"
    },
    answer: "A"
  },
  {
    id: 230,
    chapter: 9,
    type: "单选题",
    question: "（   ）是国家根本法，是党和人民意志的集中体现，是国家各种制度和法律法规的总依据。",
    options: {
      A: "宪法",
      B: "刑法",
      C: "诉讼法",
      D: "民法典"
    },
    answer: "A"
  },
  {
    id: 231,
    chapter: 9,
    type: "单选题",
    question: "建设中国特色社会主义法治体系，必须坚持（     ）先行。",
    options: {
      A: "立法",
      B: "执法",
      C: "司法",
      D: "守法"
    },
    answer: "A"
  },
  {
    id: 232,
    chapter: 9,
    type: "单选题",
    question: "我们讲坚持依宪治国、依宪执政，就包括坚持宪法确定的（  ）地位不动摇。",
    options: {
      A: "中国共产党领导",
      B: "人民当家作主",
      C: "社会主义法治",
      D: "宪法权威"
    },
    answer: "D"
  },
  {
    id: 233,
    chapter: 9,
    type: "单选题",
    question: "（    ）维护社会公平正义的最后一道防线。",
    options: {
      A: "科学立法",
      B: "严格执法",
      C: "公正司法",
      D: "全民守法"
    },
    answer: "C"
  },
  {
    id: 234,
    chapter: 9,
    type: "单选题",
    question: "全面依法治国的总目标是（   ）。",
    options: {
      A: "建设中国特色社会主义法治体系，建设社会主义法治国家",
      B: "建设中国特色社会主义法治体系",
      C: "建设中国特色社会主义法治国家",
      D: "有法可依、有法必依、违法必究、执法必严"
    },
    answer: "A"
  },
  {
    id: 235,
    chapter: 9,
    type: "多选题",
    question: "中国特色社会主义法治道路的核心要义是（    ）。",
    options: {
      A: "坚持党的领导",
      B: "坚持中国特色社会主义制度",
      C: "贯彻中国特色社会主义法治理论",
      D: "坚持社会主义根本制度"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 236,
    chapter: 9,
    type: "多选题",
    question: "要坚持（   ）相结合，实现法治和德治相辅相成、相得益彰。",
    options: {
      A: "依法治国",
      B: "协同发展",
      C: "全面发展",
      D: "以德治国"
    },
    answer: ["A", "D"]
  },
  {
    id: 237,
    chapter: 9,
    type: "多选题",
    question: "走中国特色社会主义法治道路，必须长期坚持以下哪些基本原则（ ）。",
    options: {
      A: "坚持中国共产党的领导",
      B: "坚持人民主体地位",
      C: "坚持法律面前人人平等",
      D: "坚持依法治国与以德治国相结合",
      E: "从中国具体实际出发"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 238,
    chapter: 9,
    type: "多选题",
    question: "更好推进中国特色社会主义法治体系建设，必须加快形成（  ）。",
    options: {
      A: "完备的法律规范体系",
      B: "高效的法治实施体系",
      C: "严密的法治监督体系",
      D: "有力的法治保障体系",
      E: "完善的党内法规体系"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 239,
    chapter: 9,
    type: "多选题",
    question: "准确把握全面推进依法治国重点任务，着力推进（   ）。",
    options: {
      A: "科学立法",
      B: "严格执法",
      C: "公正司法",
      D: "全民守法"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 240,
    chapter: 9,
    type: "判断题",
    question: "“立善法于天下，则天下治；立善法于一国，则一国治。”全面依法治国，必须加快完善中国特色社会主义法律体系，使之更加科学完备、统一权威。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 241,
    chapter: 9,
    type: "判断题",
    question: "建设中国特色社会主义法治体系、建设社会主义法治国家是实现国家治理体系和治理能力现代化的必然要求，也是全面深化改革的必然要求，有利于在法治轨道上推进国家治理体系和治理能力现代化。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 242,
    chapter: 9,
    type: "判断题",
    question: "中国特色社会主义法治道路的核心要义，就是要坚持党的领导，坚持中国特色社会主义制度，贯彻中国特色社会主义法治理论。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 243,
    chapter: 9,
    type: "判断题",
    question: "法治可以脱离一定社会经济、政治和文化所提供的社会条件。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 244,
    chapter: 9,
    type: "判断题",
    question: "全面推进依法治国的总抓手是坚持党的领导。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 245,
    chapter: 10,
    type: "单选题",
    question: "我们坚定文化自信的深厚基础源自于（ ）",
    options: {
      A: "中华优秀传统文化",
      B: "革命文化",
      C: "社会主义先进文化",
      D: "中国特色社会主义伟大实践"
    },
    answer: "A"
  },
  {
    id: 246,
    chapter: 10,
    type: "单选题",
    question: "（ ）是推动社会主义文化繁荣兴盛的唯一正确道路。",
    options: {
      A: "中国特色社会主义法治发展道路",
      B: "中国特色社会主义政治发展道路",
      C: "中国特色社会主义文化发展道路",
      D: "中国特色社会主义生态发展道路"
    },
    answer: "C"
  },
  {
    id: 247,
    chapter: 10,
    type: "单选题",
    question: "坚持马克思主义在意识形态领域指导地位的制度是中国特色社会主义制度体系的一项（ ）",
    options: {
      A: "根本制度",
      B: "基本制度",
      C: "重要制度",
      D: "其它制度"
    },
    answer: "A"
  },
  {
    id: 248,
    chapter: 10,
    type: "单选题",
    question: "一个国家的文化软实力，从根本上说，取决于其（ ）",
    options: {
      A: "国际传播能力",
      B: "国家的综合国力",
      C: "核心价值观的生命力、凝聚力、感召力",
      D: "国际话语权"
    },
    answer: "C"
  },
  {
    id: 249,
    chapter: 10,
    type: "单选题",
    question: "（ ）是一个国家、一个民族的灵魂，是人民的精神家园，也是政党的精神旗帜。",
    options: {
      A: "文化",
      B: "传统文化",
      C: "现代文化",
      D: "普世价值"
    },
    answer: "A"
  },
  {
    id: 250,
    chapter: 10,
    type: "单选题",
    question: "健全现代文化产业体系，要坚持把（ ）放在首位。",
    options: {
      A: "社会效益",
      B: "经济效益",
      C: "提高国家文化软实力",
      D: "提升公共文化服务水平"
    },
    answer: "A"
  },
  {
    id: 251,
    chapter: 10,
    type: "单选题",
    question: "广泛开展共产主义远大理想和（ ）教育，是团结全体人民共同奋斗的重要基础。",
    options: {
      A: "中国特色社会主义共同理想",
      B: "党史",
      C: "社会主义核心价值观",
      D: "意识形态"
    },
    answer: "A"
  },
  {
    id: 252,
    chapter: 10,
    type: "单选题",
    question: "（ ）承载着一个民族、一个国家的精神追求，体现着一个社会评判是非曲直的价值标准。",
    options: {
      A: "社会主义核心价值观",
      B: "中国特色社会主义",
      C: "科学发展观",
      D: "“三个代表”重要思想"
    },
    answer: "A"
  },
  {
    id: 253,
    chapter: 10,
    type: "单选题",
    question: "习近平在党的二十大报告中阐述了实现中国式现代化的五大原则，不包括（ ）",
    options: {
      A: "坚持中国特色社会主义道路",
      B: "坚持以人民为中心发展思想",
      C: "坚持深化改革开放",
      D: "坚持人与自然和谐共生"
    },
    answer: "D"
  },
  {
    id: 254,
    chapter: 10,
    type: "单选题",
    question: "（ ）是为国家立心、为民族立魂的工作。",
    options: {
      A: "意识形态工作",
      B: "思想政治工作",
      C: "经济建设",
      D: "政治建设"
    },
    answer: "A"
  },
  {
    id: 255,
    chapter: 10,
    type: "多选题",
    question: "文化繁荣兴盛是实现中华民族伟大复兴的必然要求，是因为（ ）",
    options: {
      A: "文化繁荣兴盛是实现中华民族伟大复兴的精神支撑",
      B: "文化繁荣兴盛是建设社会主义现代化强国的应有之义",
      C: "文化繁荣兴盛是满足人民日益增长的美好生活需要的内在要求",
      D: "文化繁荣兴盛是世界文化激荡中站稳脚跟的前提基础"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 256,
    chapter: 10,
    type: "多选题",
    question: "大力加强马克思主义理论建设，要（ ），为党和国家事业发展提供坚实的思想保证、精神力量和理论支撑。",
    options: {
      A: "加强马克思主义理论学习宣传教育",
      B: "深化马克思主义理论研究和建设",
      C: "加快构建中国特色哲学社会科学",
      D: "坚持“二为”方向、“双百”方针"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 257,
    chapter: 10,
    type: "多选题",
    question: "100多年前，中国共产党的先驱们创建了中国共产党，形成了（  ）的伟大建党精神。",
    options: {
      A: "坚持真理、坚守理想",
      B: "践行初心、担当使命",
      C: "不怕牺牲、英勇斗争",
      D: "对党忠诚、不负人民"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 258,
    chapter: 10,
    type: "多选题",
    question: "下列中国共产党人精神谱系中，属于中国特色社会主义进入新时代铸就的伟大精神的有（   ）",
    options: {
      A: "脱贫攻坚精神",
      B: "新时代北斗精神",
      C: "长征精神",
      D: "探月精神"
    },
    answer: ["A", "B", "D"]
  },
  {
    id: 259,
    chapter: 10,
    type: "多选题",
    question: "传承发展中华优秀传统文化，要推动中华优秀传统文化创造性转化、创新性发展。下列说法正确的是（  ）",
    options: {
      A: "创造性转化，就是要按照时代的新进步新进展，对中华优秀传统文化的内涵加以补充、拓展、完善，增强其影响力和感召力。",
      B: "创造性转化，就是要按照时代特点和要求，对那些至今仍有借鉴价值的内涵和陈旧的表现形式加以改造，赋予其新的时代内涵和现代表达形式，激活其生命力。",
      C: "创新性发展，就是要按照时代的新进步新进展，对中华优秀传统文化的内涵加以补充、拓展、完善，增强其影响力和感召力。",
      D: "创新性发展，就是要按照时代特点和要求，对那些至今仍有借鉴价值的内涵和陈旧的表现形式加以改造，赋予其新的时代内涵和现代表达形式，激活其生命力。"
    },
    answer: ["B", "C"]
  },
  {
    id: 260,
    chapter: 10,
    type: "多选题",
    question: "以下关于坚持马克思主义在意识形态领域指导地位的根本制度的意义说法正确的是（ ）。",
    options: {
      A: "是坚持和加强党对宣传文化事业全面领导的本质要求",
      B: "是发展社会主义先进文化的有力保障",
      C: "是坚持和巩固我国社会主义制度、保证我国文化建设正确方向的必然要求",
      D: "是关系党和国家事业长远发展、关系我国文化前进方向和发展道路的重大制度创新"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 261,
    chapter: 10,
    type: "多选题",
    question: "培育和践行社会主义核心价值观，必须要（ ）。",
    options: {
      A: "把社会主义核心价值观融入社会生活各个方面",
      B: "坚持全民行动、干部带头，从家庭做起、从娃娃抓起",
      C: "立足中华优秀传统文化和革命文化",
      D: "发扬中国人民在长期奋斗中培育、继承、发展起来的伟大民族精神"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 262,
    chapter: 10,
    type: "多选题",
    question: "文化自信是更基础、更广泛、更深厚的自信，是一个国家、一个民族发展中（ ）的力量。",
    options: {
      A: "最坚定",
      B: "最基本",
      C: "最突出",
      D: "最深沉",
      E: "最持久"
    },
    answer: ["B", "D", "E"]
  },
  {
    id: 263,
    chapter: 10,
    type: "多选题",
    question: "推动社会主义文化繁荣兴盛，要做到（ ）",
    options: {
      A: "牢牢掌握意识形态工作领导权",
      B: "培育和践行社会主义核心价值观",
      C: "坚定文化自信，建设社会主义文化强国",
      D: "加快构建中国特色哲学社会科学",
      E: "大力发展文化事业和文化产业"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 264,
    chapter: 10,
    type: "判断题",
    question: "文化自信是更基础、更广泛、更深厚的自信，是一个国家、一个民族发展中最基本、最深沉、最持久的力量。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 265,
    chapter: 10,
    type: "判断题",
    question: "坚持马克思主义在意识形态领域指导地位的根本制度，是坚持和巩固我国社会主义制度、保证我国文化建设正确方向的必然要求。（）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 266,
    chapter: 10,
    type: "判断题",
    question: "培育和践行社会主义核心价值观，要把社会主义核心价值观融入社会生活各个方面，达到\"百姓日用而不知\"的程度。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 267,
    chapter: 10,
    type: "判断题",
    question: "深化文化体制改革，完善文化产业规划和政策，加强文化市场体系建设，扩大优质文化产品供给，是健全现代文化产业体系的重要抓手。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 268,
    chapter: 10,
    type: "判断题",
    question: "新时代，要大力弘扬党和人民在各个历史时期奋斗中形成的井冈山精神、延安精神、“两弹一星”精神、特区精神、抗疫精神等伟大精神，大力发展社会主义先进文化。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 269,
    chapter: 10,
    type: "判断题",
    question: "文化软实力集中体现了一个国家基于文化而具有的凝聚力和生命力，以及由此产生的吸引力和影响力。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 270,
    chapter: 10,
    type: "判断题",
    question: "具有高度文化素养的国民、发达的文化产业、强大的文化软实力都是文化强国的重要表现。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 271,
    chapter: 10,
    type: "判断题",
    question: "新闻舆论工作有鲜明的意识形态属性，坚持正确的政治方向是做好新闻舆论工作的第一位要求。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 272,
    chapter: 10,
    type: "判断题",
    question: "实现中华民族伟大复兴，迫切要求我国由一个文化大国转变成为一个文化强国，这是中华民族几千年文化积淀赋予我们的历史使命。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 273,
    chapter: 10,
    type: "判断题",
    question: "没有高度的文化自信就没有中华民族伟大复兴。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 274,
    chapter: 11,
    type: "单选题",
    question: "（ ）是我们坚持立党为公、执政为民的本质要求。",
    options: {
      A: "增进民生福祉",
      B: "建立强大国防",
      C: "全面依法治国",
      D: "坚持党的领导"
    },
    answer: "A"
  },
  {
    id: 275,
    chapter: 11,
    type: "单选题",
    question: "（ ）是现代化建设的出发点和落脚点。",
    options: {
      A: "问题导向",
      B: "构建新发展格局",
      C: "促进高质量发展",
      D: "实现人民对美好生活的向往"
    },
    answer: "D"
  },
  {
    id: 276,
    chapter: 11,
    type: "单选题",
    question: "民生是人民幸福之基、社会和谐之本。带领人民群众创造幸福生活，要顺应人民群众对美好生活的向往，坚持（  ）的发展思想，以（  ）为重点，发展各项事业。",
    options: {
      A: "以经济建设为中心;保障和改善民生",
      B: "以人民为中心，保障和改善民生",
      C: "以人为本;提高就业质量和人民收入水平",
      D: "以社会和谐为中心;加强社会保障体系建设"
    },
    answer: "B"
  },
  {
    id: 277,
    chapter: 11,
    type: "单选题",
    question: "（ ）是政府联系群众的最后一公里。",
    options: {
      A: "城乡社区",
      B: "居委会",
      C: "村委会",
      D: "基层党支部"
    },
    answer: "A"
  },
  {
    id: 278,
    chapter: 11,
    type: "单选题",
    question: "（ ）是最大的民生工程、民心工程、根基工程，是社会稳定的重要保障。",
    options: {
      A: "生活水平",
      B: "生产",
      C: "就业",
      D: "共同富裕"
    },
    answer: "C"
  },
  {
    id: 279,
    chapter: 11,
    type: "单选题",
    question: "坚持以人民为中心的发展思想，在高质量发展中促进共同富裕，正确处理（ ）的关系，构建初次分配、再分配、三次分配协调配套的基础性制度安排。",
    options: {
      A: "收入与分配",
      B: "效率与公平",
      C: "经济与社会",
      D: "政府与市场"
    },
    answer: "B"
  },
  {
    id: 280,
    chapter: 11,
    type: "单选题",
    question: "（ ）是“国之大者”。",
    options: {
      A: "让人民生活幸福",
      B: "中国式现代化",
      C: "从严治党",
      D: "坚持和发展中国特色社会主义"
    },
    answer: "A"
  },
  {
    id: 281,
    chapter: 11,
    type: "单选题",
    question: "（ ）是进行社会治理的基础，也是提高社会治理效能的保障。",
    options: {
      A: "社会治理体系",
      B: "中国特色社会主义制度",
      C: "党的领导",
      D: "全面深化改革"
    },
    answer: "A"
  },
  {
    id: 282,
    chapter: 11,
    type: "单选题",
    question: "（ ）是民生之源，是改善民生、实现发展成果由人民共享最重要最直接的方式。",
    options: {
      A: "促进社会公平",
      B: "满足人们日益增长的美好生活需要",
      C: "缩小城乡差距",
      D: "收入分配"
    },
    answer: "D"
  },
  {
    id: 283,
    chapter: 11,
    type: "单选题",
    question: "（ ）是保障和改善民生的重要原则。",
    options: {
      A: "坚持人人尽责，人人享有",
      B: "坚持人民主体地位",
      C: "实现共同富裕",
      D: "坚持实事求是"
    },
    answer: "A"
  },
  {
    id: 284,
    chapter: 11,
    type: "多选题",
    question: "增进民生福祉是（  ）。",
    options: {
      A: "坚持立党为公、执政为民的本质要求",
      B: "社会主义生产的根本目的",
      C: "全面建设社会主义现代化国家的应有之义",
      D: "经济社会发展的根本目的"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 285,
    chapter: 11,
    type: "多选题",
    question: "在脱贫攻坚战中，推进“五个一批”工程，即（ ）。",
    options: {
      A: "发展生产脱贫一批",
      B: "易地搬迁脱贫一批",
      C: "生态补偿脱贫一批",
      D: "发展教育脱贫一批",
      E: "社会保障兜底一批"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 286,
    chapter: 11,
    type: "多选题",
    question: "保障和改善民生的工作思路是（ ）。",
    options: {
      A: "坚守底线",
      B: "突出重点",
      C: "完善制度",
      D: "引导预期"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 287,
    chapter: 11,
    type: "多选题",
    question: "（ ）是保障和改善民生的重要方针。",
    options: {
      A: "尽力而为",
      B: "量力而行",
      C: "突出重点",
      D: "正确把握民生和发展的关系"
    },
    answer: ["A", "B"]
  },
  {
    id: 288,
    chapter: 11,
    type: "多选题",
    question: "社会保障体系主要涉及（ ）等方面。",
    options: {
      A: "社会保险",
      B: "社会救助",
      C: "社会福利",
      D: "社会优抚"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 289,
    chapter: 11,
    type: "判断题",
    question: "社会建设主要包括两个方面重点:一是提高保障和改善民生水平、二是加强和创新社会治理。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 290,
    chapter: 11,
    type: "判断题",
    question: "推进社会治理现代化的目标是建设人人有责、人人尽责、人人享有的社会治理共同体。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 291,
    chapter: 11,
    type: "判断题",
    question: "保障和改善民生的重要原则是只要尽力而为，不要量力而行。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 292,
    chapter: 11,
    type: "判断题",
    question: "发展是解决民生问题的“总钥匙”，民生是发展的“指南针”。要在发展过程中始终注重民生、保障民生、改善民生。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 293,
    chapter: 11,
    type: "判断题",
    question: "解决人民群众最关心最直接最现实的利益问题,是保障和改善民生的重中之重。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 294,
    chapter: 12,
    type: "单选题",
    question: "(   )提出:“要像保护眼睛一样保护生态环境，像对待生命一样对待生态环境，”",
    options: {
      A: "邓小平",
      B: "江泽民",
      C: "胡锦涛",
      D: "习近平"
    },
    answer: "D"
  },
  {
    id: 295,
    chapter: 12,
    type: "单选题",
    question: "(       )是工业文明发展到一定阶段的产物。",
    options: {
      A: "农业文明",
      B: "中华文明",
      C: "生态文明",
      D: "文明交流"
    },
    answer: "C"
  },
  {
    id: 296,
    chapter: 12,
    type: "单选题",
    question: "“天地与我并生，而万物与我为一”的“天人合一”思想，代表着我们祖先对处理(   )的关系的重要认识。",
    options: {
      A: "天与地",
      B: "人与自然",
      C: "人与社会",
      D: "人与人"
    },
    answer: "B"
  },
  {
    id: 297,
    chapter: 12,
    type: "单选题",
    question: "处理好绿水青山和金山银山的关系，关键在人，关键在(   )。",
    options: {
      A: "效益",
      B: "钱",
      C: "思路",
      D: "高质量发展"
    },
    answer: "C"
  },
  {
    id: 298,
    chapter: 12,
    type: "单选题",
    question: "习近平指出:“(    )是最公平的公共产品，是最普惠的民生福祉。”",
    options: {
      A: "一带一路",
      B: "法律面前人人平等",
      C: "良好的生态环境",
      D: "按劳分配"
    },
    answer: "C"
  },
  {
    id: 299,
    chapter: 12,
    type: "单选题",
    question: "(   )是全面建设社会主义现代化国家的重要目标，也是满足人民日益增长的优美生态环境需要的必然要求。",
    options: {
      A: "依法治国",
      B: "建设美丽中国",
      C: "共同富裕",
      D: "建设文化强国"
    },
    answer: "B"
  },
  {
    id: 300,
    chapter: 12,
    type: "单选题",
    question: "要树立尊重自然、顺应自然、保护自然的生态文明理念，增强(   )的意识。",
    options: {
      A: "金山银山不如绿水青山",
      B: "绿水青山就是金山银山",
      C: "金山银山就是绿水青山",
      D: "绿水青山胜过金山银山"
    },
    answer: "B"
  },
  {
    id: 301,
    chapter: 12,
    type: "单选题",
    question: "加快构建生态文明体系，确保到(   )美丽中国目标基本实现。",
    options: {
      A: "2020年",
      B: "2025年",
      C: "2030年",
      D: "2035年"
    },
    answer: "D"
  },
  {
    id: 302,
    chapter: 12,
    type: "单选题",
    question: "人因自然而生，人与自然是一种(      )。",
    options: {
      A: "利用关系",
      B: "共生关系",
      C: "敌对关系",
      D: "生存关系"
    },
    answer: "B"
  },
  {
    id: 312,
    chapter: 12,
    type: "多选题",
    question: "绿水青山是(      )。",
    options: {
      A: "自然财富",
      B: "生态财富",
      C: "社会财富",
      D: "经济财富"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 313,
    chapter: 12,
    type: "多选题",
    question: "对“绿水青山就是金山银山”的理解，正确的观点是(   )。",
    options: {
      A: "这是重要的发展理念",
      B: "也是推进现代化建设的重大原则",
      C: "阐明了经济发展与生态环境保护之间的关系",
      D: "揭示了保护生态环境就是保护生产力、改善生态环境就是发展生产力的道理",
      E: "指明了实现发展和保护协同共生的新路径"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 314,
    chapter: 12,
    type: "多选题",
    question: "共建清洁美丽世界，必须(   )。",
    options: {
      A: "坚持以人为本",
      B: "坚持多边主义",
      C: "坚持共同但有区别的责任原则",
      D: "坚持科学治理"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 315,
    chapter: 12,
    type: "多选题",
    question: "把建设美丽中国转化为全体人民自觉行动,要做到(   )。",
    options: {
      A: "坚持用最严格制度最严密法治保护生态环境的同时，激发起全社会共同呵护生态环境的内生动力",
      B: "增强全民节约意识、环保意识、生态意识",
      C: "培育生态道德和行为准则，开展全民绿色行动",
      D: "动员全社会都以实际行动减少能源资源消耗和污染排放",
      E: "加快形成绿色生产方式和生活方式"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 316,
    chapter: 12,
    type: "多选题",
    question: "保护生态环境必须依靠制度、依靠法治,要做到(   )。",
    options: {
      A: "构建产权清晰、多元参与、激励约束并重、系统完整的生态文明制度体系",
      B: "实行最严格的生态环境保护制度",
      C: "全面建立资源高效利用制度",
      D: "严明生态环境保护责任制度",
      E: "严格执行制度"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 317,
    chapter: 12,
    type: "判断题",
    question: "良好的生态环境是最普惠的民生福祉。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 318,
    chapter: 12,
    type: "判断题",
    question: "绿水青山可带来金山银山，金山银山也可买到绿水青山。（   ）",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 319,
    chapter: 12,
    type: "判断题",
    question: "生态环境保护和经济发展是矛盾对立的关系，是鱼和熊掌不可兼得的。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 320,
    chapter: 12,
    type: "判断题",
    question: "建设生态文明是顺应人类文明进程.实现人与自然和谐共生的必然要求，具有历史必然性。（       ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 321,
    chapter: 14,
    type: "单选题",
    question: "党的十八大以来，以习近平同志为核心的党中央围绕新时代( )，深入进行理论探索和实践创造，形成...",
    options: {
      A: "坚持和发展什么样的中国特色社会主义、怎样坚持和发展中国特色社会主义",
      B: "建设什么样的社会主义现代化强国、怎样建设社会主义现代化强国",
      C: "建设什么样的长期执政的马克思主义政党、怎样建设长期执政的马克思主义政党",
      D: "建设一支什么样的强大人民军队、怎样建设强大人民军队"
    },
    answer: "D"
  },
  {
    id: 322,
    chapter: 14,
    type: "单选题",
    question: "习近平强军思想明确(   )是人民军队建军之本、强军之魂。",
    options: {
      A: "政治工作",
      B: "党对人民军队的绝对领导",
      C: "练兵备战",
      D: "先进科技"
    },
    answer: "B"
  },
  {
    id: 323,
    chapter: 14,
    type: "单选题",
    question: "把( )作为唯一的根本的标准，是有效履行我军根本职能的内在要求，也是提高军队建设质量效益的客观要求。",
    options: {
      A: "政治建军",
      B: "军事改革",
      C: "战斗力",
      D: "军事创新"
    },
    answer: "C"
  },
  {
    id: 324,
    chapter: 14,
    type: "单选题",
    question: "(   )明确提出，党在新时代的强军目标是建设一支听党指挥、能打胜仗、作风优良的人民军队,把人民军队建设成为世界一流军队。",
    options: {
      A: "2012年12月，中央军委扩大会议",
      B: "党的十九大",
      C: "2013年3月，十二届全国人大一次会议",
      D: "党的二十大"
    },
    answer: "B"
  },
  {
    id: 325,
    chapter: 14,
    type: "单选题",
    question: "在新时代的强军目标中，(   )是核心。",
    options: {
      A: "听党指挥",
      B: "能打胜仗",
      C: "作风优良",
      D: "全面建成世界一流军队"
    },
    answer: "B"
  },
  {
    id: 326,
    chapter: 14,
    type: "单选题",
    question: "90多年来，人民军队之所以能够始终保持强大的凝聚力向心力战斗力，经受住各种考验，不断从胜利走向胜利，最根本的就是靠(    )。",
    options: {
      A: "一不怕苦，二不怕死",
      B: "中国共产党的坚强领导",
      C: "改革开放的成功",
      D: "发展先进科学技术"
    },
    answer: "B"
  },
  {
    id: 327,
    chapter: 14,
    type: "单选题",
    question: "(   )是人民军队的鲜明特色和政治优势，也是人民军队战无不胜、攻无不克的重要保证。",
    options: {
      A: "能打胜仗",
      B: "军民情谊",
      C: "听党指挥",
      D: "作风优良"
    },
    answer: "D"
  },
  {
    id: 328,
    chapter: 14,
    type: "单选题",
    question: "要充分发挥政治工作对强军兴军的生命线作用，培养有灵魂、( )、有血性、有品德的新时代革命军人。",
    options: {
      A: "不怕苦",
      B: "有本事",
      C: "淡泊名利",
      D: "崇尚光荣"
    },
    answer: "D"
  },
  {
    id: 329,
    chapter: 14,
    type: "单选题",
    question: "力争到二〇三五年( )国防和军队现代化，到本世纪中叶把人民军队( )世界一流军队。",
    options: {
      A: "全面实现;基本建成",
      B: "全面实现;全面建成",
      C: "基本实现;基本建成",
      D: "基本实现;全面建成"
    },
    answer: "D"
  },
  {
    id: 330,
    chapter: 14,
    type: "单选题",
    question: "军队是要准备打仗的，一切工作都必须坚持(   )标准，向能打仗、打胜仗聚焦。",
    options: {
      A: "战斗力",
      B: "斗争力",
      C: "战争力",
      D: "硬实力"
    },
    answer: "A"
  },
  {
    id: 331,
    chapter: 14,
    type: "多选题",
    question: "新时代人民军队的使命任务是(    )。",
    options: {
      A: "为巩固中国共产党领导和我国社会主义制度提供战略支撑",
      B: "为捍卫国家主权、统一和领土完整提供战略支撑",
      C: "为维护我国海外利益提供战略支撑",
      D: "为促进世界和平与发展提供战略支撑"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 332,
    chapter: 14,
    type: "多选题",
    question: "党在新时代的强军目标是建设一支(    )的人民军队。",
    options: {
      A: "听党指挥",
      B: "能打胜仗",
      C: "作风优良",
      D: "敢于创新"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 333,
    chapter: 14,
    type: "多选题",
    question: "新的征程上，开创国防和军队现代化新局面，必须全面推进(    ), 加快把人民军队建设成为世界一流军队。",
    options: {
      A: "政治建军",
      B: "改革强军",
      C: "科技强军",
      D: "人才强军",
      E: "依法治军"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 334,
    chapter: 14,
    type: "多选题",
    question: "我国国防和军队建设“新三步走”战略安排是(   )。",
    options: {
      A: "到2027年，实现建军一百年奋斗目标",
      B: "到2035年，基本实现国防和军队现代化",
      C: "到本世纪中叶，把人民军队全面建成世界一流军队",
      D: "到2050年，全面实现军事作战无人化、智能化"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 335,
    chapter: 14,
    type: "判断题",
    question: "深化国防和军队改革总体目标是，牢牢把握“军委管总、战区主战、军种主建”的原则。(         )",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 336,
    chapter: 14,
    type: "判断题",
    question: "改革是决定人民军队发展壮大、制胜未来的关键一招。(      )",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 337,
    chapter: 14,
    type: "判断题",
    question: "军政军民团结是实现富国和强军相统一的重要政治保障。要加强国防动员和后备力量建设，增强打赢未来战争的国防潜力。(      )",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 338,
    chapter: 14,
    type: "判断题",
    question: "巩固提高一体化国家战略体系和能力，是党中央把握强国强军面临的新形势新任务新要求，着眼于更好统筹发展和安全、更好统筹经济建设和国防建设作出的战略部署。( )",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 339,
    chapter: 14,
    type: "判断题",
    question: "人民军队将在本世纪中叶基本实现国防和军队现代化。(   )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 340,
    chapter: 13,
    type: "单选题",
    question: "坚持总体国家安全观，必须坚持以（     ）为宗旨。",
    options: {
      A: "人民安全",
      B: "政治安全",
      C: "国内安全",
      D: "国际安全"
    },
    answer: "A"
  },
  {
    id: 341,
    chapter: 13,
    type: "单选题",
    question: "（   ）是人民幸福安康的基本要求，是安邦定国的重要基石。",
    options: {
      A: "国家富强",
      B: "人民富裕",
      C: "社会稳定",
      D: "国家安全"
    },
    answer: "D"
  },
  {
    id: 342,
    chapter: 13,
    type: "单选题",
    question: "以下不是反映中华优秀传统文化中蕴含着丰富的国家安全战略思想的是（  ）",
    options: {
      A: "“生于忧患，死于安乐”",
      B: "“亲人善邻，国之宝也”",
      C: "“内事文而和，外事武而义”",
      D: "“美人之美，美美与共”"
    },
    answer: "D"
  },
  {
    id: 343,
    chapter: 13,
    type: "单选题",
    question: "国家安全工作，归根结底是保障（  ），为群众安居乐业提供坚强保障。有了安全感，获得感才有保障，幸福感才会持久。",
    options: {
      A: "人民利益",
      B: "社会稳定",
      C: "经济发展",
      D: "领土完整"
    },
    answer: "A"
  },
  {
    id: 344,
    chapter: 13,
    type: "单选题",
    question: "每年（  ）被确定为全民国家安全教育日。",
    options: {
      A: "2.15",
      B: "3.15",
      C: "4.15",
      D: "5.15"
    },
    answer: "C"
  },
  {
    id: 345,
    chapter: 13,
    type: "单选题",
    question: "（ ）将“坚持总体国家安全观”纳入新时代坚持和发展中国特色社会主义的基本方略，并写入党章。",
    options: {
      A: "党的十八届三中全会",
      B: "党的十九届六中全会",
      C: "党的十九大",
      D: "党的二十大"
    },
    answer: "C"
  },
  {
    id: 346,
    chapter: 13,
    type: "单选题",
    question: "坚持总体国家安全观，以（  ）为根本。",
    options: {
      A: "人民安全",
      B: "政治安全",
      C: "国内安全",
      D: "国际安全"
    },
    answer: "B"
  },
  {
    id: 347,
    chapter: 13,
    type: "单选题",
    question: "走中国特色国家安全道路，努力开创国家安全工作新局面，是对总体国家安全观的贯彻落实，归根结底是为了确保（  ）进程不被迟滞甚至中断。",
    options: {
      A: "社会主义现代化建设",
      B: "全体人民共同富裕",
      C: "中华民族伟大复兴",
      D: "经济社会发展"
    },
    answer: "C"
  },
  {
    id: 348,
    chapter: 13,
    type: "单选题",
    question: "（ ）与人民群众切身利益关系最密切，是人民群众安全感的晴雨表，是社会安定的风向标。",
    options: {
      A: "政治安全",
      B: "经济安全",
      C: "社会安全",
      D: "文化安全"
    },
    answer: "C"
  },
  {
    id: 349,
    chapter: 13,
    type: "单选题",
    question: "（ ）是中华民族能够生生不息、绵延不绝的文化基因，也是融入中国共产党精神血脉的政治品质。",
    options: {
      A: "以和为贵",
      B: "忧患意识",
      C: "天下一家",
      D: "大同世界"
    },
    answer: "B"
  },
  {
    id: 350,
    chapter: 13,
    type: "单选题",
    question: "面对波谲云诡的国际形势、复杂敏感的周边环境、艰巨繁重的改革发展稳定任务，我们必须树立（  ）。",
    options: {
      A: "忧患意识",
      B: "零和思维",
      C: "底线思维",
      D: "全局意识"
    },
    answer: "C"
  },
  {
    id: 351,
    chapter: 13,
    type: "单选题",
    question: "总体国家安全观关键在（     ）",
    options: {
      A: "国土安全",
      B: "坚持全国一盘棋",
      C: "经济安全",
      D: "总体"
    },
    answer: "D"
  },
  {
    id: 352,
    chapter: 13,
    type: "单选题",
    question: "国家安全工作，归根结底是（   ）",
    options: {
      A: "实现世界和平",
      B: "保证国家稳定",
      C: "保障人民利益",
      D: "维护社会治安"
    },
    answer: "C"
  },
  {
    id: 353,
    chapter: 13,
    type: "单选题",
    question: "（  ）的核心是政权安全和制度安全，最根本的就是维护中国共产党的领导和执政地位、维护中国特色社会主义制度。",
    options: {
      A: "经济安全",
      B: "军事安全",
      C: "政治安全",
      D: "人民安全"
    },
    answer: "C"
  },
  {
    id: 354,
    chapter: 13,
    type: "多选题",
    question: "加强（ ）, 巩固国家安全人民防线。",
    options: {
      A: "国家安全宣传教育",
      B: "全民国防教育",
      C: "文化素质教育",
      D: "爱国主义教育"
    },
    answer: ["A", "B"]
  },
  {
    id: 355,
    chapter: 13,
    type: "多选题",
    question: "网络安全已经成为我国面临的（ ）的非传统安全问题之一。",
    options: {
      A: "最普遍",
      B: "最复杂",
      C: "最现实",
      D: "最严峻"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 356,
    chapter: 13,
    type: "多选题",
    question: "要坚持（ ）的新安全观，积极塑造外部安全环境。",
    options: {
      A: "共同",
      B: "综合",
      C: "合作",
      D: "可持续"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 357,
    chapter: 13,
    type: "多选题",
    question: "我们要打赢防范化解重大风险攻坚战，必须坚持和完善（ ）、推进（ ），运用制度威力应对风险挑战的冲击。",
    options: {
      A: "中国特色社会主义道路",
      B: "中国特色社会主义制度",
      C: "国家治理体系和治理能力现代化",
      D: "安全和发展一体化"
    },
    answer: ["B", "C"]
  },
  {
    id: 358,
    chapter: 13,
    type: "多选题",
    question: "要加强（ ）建设，坚决捍卫领土主权和海洋权益。",
    options: {
      A: "边防",
      B: "海防",
      C: "空防",
      D: "陆防"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 359,
    chapter: 13,
    type: "多选题",
    question: "政治安全的核心是（ ）。",
    options: {
      A: "政权安全",
      B: "制度安全",
      C: "粮食安全",
      D: "人民安全"
    },
    answer: ["A", "B"]
  },
  {
    id: 360,
    chapter: 13,
    type: "多选题",
    question: "2018年4月，习近平进一步阐述了总体国家安全观，提出坚持（ ）至上的有机统一，坚持维护和塑造国家安全等重大判断。",
    options: {
      A: "人民安全",
      B: "政治安全",
      C: "国家利益",
      D: "经济发展"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 361,
    chapter: 13,
    type: "判断题",
    question: "发展和安全是一体之两翼、驱动之双轮。发展是安全的基础和目的，安全是发展的条件和保障，发展和安全要同步推进。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 362,
    chapter: 13,
    type: "判断题",
    question: "政治安全是立国之基。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 363,
    chapter: 13,
    type: "判断题",
    question: "经过不懈努力，我国的国家主权、安全、发展利益得到全面维护，社会大局保持长期稳定。中国成为世界上最有安全感的国家。",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 364,
    chapter: 13,
    type: "判断题",
    question: "以政治安全为根本，就是要坚持党的领导和中国特色社会主义制度不动摇，把制度安全、政权安全放在首要位置，为国家安全提供根本政治保证。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 365,
    chapter: 13,
    type: "判断题",
    question: "国家安全是指国家政权、主权、统一和领土完整、人民福祉、经济社会可持续发展和国家其他重大利益相对处于没有危险和不受内外威胁的状态，以及保障持续安全状态的能力。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 366,
    chapter: 13,
    type: "判断题",
    question: "总体国家安全观深化了我们党对中国特色社会主义建设规律的认识，为发展马克思主义国家安全理论作出了重大原创性贡献。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 367,
    chapter: 13,
    type: "判断题",
    question: "总体国家安全观提炼中华优秀传统战略文化，总结我们党维护国家安全的理论和实践成果，为坚持把马克思主义基本原理同中国具体实际相结合、同中华优秀传统文化相结合树立了光辉典范。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 368,
    chapter: 13,
    type: "判断题",
    question: "总体国家安全观开辟了国家安全治理新路径，为推动和完善全球安全治理贡献了中国方案。",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 369,
    chapter: 15,
    type: "单选题",
    question: "“一国两制”伟大构想，最早是针对( )提出来的。",
    options: {
      A: "香港问题",
      B: "澳门问题",
      C: "金门问题",
      D: "台湾问题"
    },
    answer: "D"
  },
  {
    id: 370,
    chapter: 15,
    type: "单选题",
    question: "“一国两制”的根本宗旨是( )。",
    options: {
      A: "保持香港、澳门长期繁荣稳定",
      B: "解决台湾问题",
      C: "维护国家主权、安全、发展利益，保持香港、澳门长期繁荣稳定",
      D: "实现中华民族伟大复兴"
    },
    answer: "C"
  },
  {
    id: 371,
    chapter: 15,
    type: "单选题",
    question: "( )，这是实现祖国统一的战略思路。",
    options: {
      A: "坚持“和平统一、一国两制”基本方针",
      B: "坚持一个中国原则和“九二共识”",
      C: "坚持推动两岸关系融合发展",
      D: "坚持在祖国大陆发展进步基础上解决台湾问题"
    },
    answer: "D"
  },
  {
    id: 372,
    chapter: 15,
    type: "单选题",
    question: "（ ）是两岸关系的政治基础。",
    options: {
      A: "继续推进两岸“三通”",
      B: "促进两岸人文交流",
      C: "协商解决两岸同胞关心的问题",
      D: "一个中国原则"
    },
    answer: "D"
  },
  {
    id: 373,
    chapter: 15,
    type: "单选题",
    question: "“一国两制”是一个完整的概念。“一国”是实行“两制”的（ ），“两制”从属和派生于“一国”并统一于“一国”之内。",
    options: {
      A: "目标和原则",
      B: "前提和基础",
      C: "方向和路径",
      D: "结果和目标"
    },
    answer: "B"
  },
  {
    id: 374,
    chapter: 15,
    type: "单选题",
    question: "中央政府对特别行政区拥有（ ），这是特别行政区高度自治权的源头。",
    options: {
      A: "自主选择权",
      B: "全面管治权",
      C: "高度管理权",
      D: "立法管治权"
    },
    answer: "B"
  },
  {
    id: 375,
    chapter: 15,
    type: "单选题",
    question: "能够确保香港、澳门回归后长期繁荣稳定的最佳制度是（ ）。",
    options: {
      A: "一国两制",
      B: "社会主义制度",
      C: "资本主义制度",
      D: "中西结合制度"
    },
    answer: "A"
  },
  {
    id: 376,
    chapter: 15,
    type: "单选题",
    question: "两岸关系和平发展的最大障碍是（ ）。",
    options: {
      A: "“台独”",
      B: "制度不同",
      C: "经济发展水平不同",
      D: "信仰不同"
    },
    answer: "A"
  },
  {
    id: 377,
    chapter: 15,
    type: "单选题",
    question: "( )，这是实现祖国统一的战略支撑。",
    options: {
      A: "坚持党中央对对台工作的集中统一领导",
      B: "坚持反对外部势力干涉",
      C: "坚持团结台湾同胞、争取台湾民心",
      D: "坚持决不承诺放弃使用武力"
    },
    answer: "D"
  },
  {
    id: 378,
    chapter: 15,
    type: "多选题",
    question: "在“一国两制”之下，作为直辖于中央人民政府的香港、澳门特别行政区，享有高度自治权，包括（ ）。",
    options: {
      A: "行政管理权",
      B: "立法权",
      C: "独立的司法权和终审权",
      D: "外交权"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 379,
    chapter: 15,
    type: "多选题",
    question: "为了全面贯彻并落实“爱国者治港”原则，党中央采取措施，完善香港特别行政区选举制度，具体表现在（ ）。",
    options: {
      A: "2021年3月，十三届全国人大四次会议通过《全国人民代表大会关于完善香港特别行政区选举制度的决定》",
      B: "2021年5月，香港特别行政区立法会通过《2021年完善选举制度（综合修订）条例草案》",
      C: "2023年7月，《2023年区议会（修订）条例》刊宪并实施"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 380,
    chapter: 15,
    type: "多选题",
    question: "在新时代国家改革开放进程中，香港、澳门应该如何抓住发展机遇，更好融入国家发展大局。（  ）",
    options: {
      A: "积极主动助力国家全面开放",
      B: "积极主动参与粤港澳大湾区建设",
      C: "积极主动参与国家治理实践",
      D: "积极主动促进国际人文交流"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 381,
    chapter: 15,
    type: "多选题",
    question: "全面贯彻“一国两制”方针，就要坚持(    )正确处理与内地的制度和社会差异。",
    options: {
      A: "不抵触、不破裂",
      B: "不排斥、不冲突",
      C: "不冲击、不脱钩",
      D: "不破坏、不倒退"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 382,
    chapter: 15,
    type: "多选题",
    question: "（ ）是香港特别行政区的两项基本法回归前后保持基本不变的制度安排。",
    options: {
      A: "行政长官由中央任命",
      B: "特区立法会继续沿用原有关制度和办法",
      C: "特区人民继续保留原有财产权益",
      D: "特区继续实行原有国际组织及宪章的成员资格"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 383,
    chapter: 15,
    type: "多选题",
    question: "在新时代全面推进“一国两制”实践中，要以（   ）为核心，推动各项制度更加成熟更加定型。",
    options: {
      A: "维护宪法和基本法权威",
      B: "维护国家主权、安全、发展利益",
      C: "维护香港、澳门长期繁荣稳定",
      D: "维护香港、澳门同胞福祉"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 384,
    chapter: 15,
    type: "多选题",
    question: "党的十八大以来，党中央全面准确贯彻“一国两制”方针，牢牢掌握（ ）赋予的中央对香港、澳门全面管治权。",
    options: {
      A: "宪法",
      B: "基本法",
      C: "民法",
      D: "刑法"
    },
    answer: ["A", "B"]
  },
  {
    id: 385,
    chapter: 15,
    type: "判断题",
    question: "“台独”分裂势力及其活动损害国家主权和领土完整，是两岸关系和平发展的最大障碍，是台海和平稳定的重大威胁。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 386,
    chapter: 15,
    type: "判断题",
    question: "对香港、澳门来说，“一国两制”是最大的优势，国家改革开放是最大的舞台，共建“一带一路”、粤港澳大湾区建设等，为港澳发展提供了广阔空间。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 387,
    chapter: 15,
    type: "判断题",
    question: "台湾问题因民族弱乱而产生，必将随着民族复兴而解决。台湾前途在于国家统一，台湾同胞福祉系于民族复兴大局。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 388,
    chapter: 15,
    type: "判断题",
    question: "实现“一国两制”的前提和基础是港、澳、台享有高度自治权。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 389,
    chapter: 15,
    type: "判断题",
    question: "必须始终维护中央全面管治权，在任何时候，都不能将全面管治权和高度自治权对立起来；在任何情况下，都要坚持“一国两制”实践的根本原则。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 390,
    chapter: 16,
    type: "单选题",
    question: "坚持以( )为统领加强党对对外工作的集中统一领导。",
    options: {
      A: "实现中华民族伟大复兴",
      B: "维护党中央权威",
      C: "政治纪律",
      D: "党中央"
    },
    answer: "B"
  },
  {
    id: 391,
    chapter: 16,
    type: "单选题",
    question: "坚持以( )为原则推动“一带一路”建设。",
    options: {
      A: "平等协商",
      B: "互利共赢",
      C: "共商共建",
      D: "共商共建共享"
    },
    answer: "D"
  },
  {
    id: 392,
    chapter: 16,
    type: "单选题",
    question: "坚持以( )为底线维护国家主权、安全、发展利益。",
    options: {
      A: "和平发展",
      B: "国土完整",
      C: "互惠互利",
      D: "国家核心利益"
    },
    answer: "D"
  },
  {
    id: 393,
    chapter: 16,
    type: "单选题",
    question: "坚持以(  )为理念引领全球治理体系改革。",
    options: {
      A: "公平正义",
      B: "集体安全",
      C: "绿色发展",
      D: "高质量发展"
    },
    answer: "A"
  },
  {
    id: 394,
    chapter: 16,
    type: "单选题",
    question: "坚持以( )为宗旨推动构建人类命运共同体。",
    options: {
      A: "中华民族伟大复兴",
      B: "维护世界和平、促进共同发展",
      C: "以共商共建共享",
      D: "维护党中央权威"
    },
    answer: "B"
  },
  {
    id: 395,
    chapter: 16,
    type: "多选题",
    question: "坚持以(   )为基础走和平发展道路。",
    options: {
      A: "不冲突不对抗",
      B: "相互尊重",
      C: "人文交流",
      D: "合作共赢"
    },
    answer: ["B", "D"]
  },
  {
    id: 396,
    chapter: 16,
    type: "多选题",
    question: "运筹好大国关系，推动构建总体稳定、均衡发展的大国关系框架至关重要。大国之间相处，要( )。",
    options: {
      A: "不冲突",
      B: "不对抗",
      C: "相互尊重",
      D: "合作共赢"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 397,
    chapter: 16,
    type: "多选题",
    question: "和平与发展仍然是当今时代主题，( )成为不可阻挡的时代潮流。",
    options: {
      A: "和平",
      B: "发展",
      C: "合作",
      D: "共赢"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 398,
    chapter: 16,
    type: "多选题",
    question: "当今世界正经历百年未有之大变局，具体表现在()。",
    options: {
      A: "世界多极化、经济全球化、社会信息化、文化多样化深入发展",
      B: "世界面临的不稳定性不确定性突出，全球性问题加剧",
      C: "国际力量对比深刻变化",
      D: "新一轮科技革命和产业变革深入发展",
      E: "国际体系和国际秩序深度调整"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 399,
    chapter: 16,
    type: "判断题",
    question: "中国走和平发展道路，不是权宜之计,更不是外交辞令，而是从历史、现实、未来的客观判断中得出的结论。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 400,
    chapter: 16,
    type: "判断题",
    question: "周边是我国安身立命之所、发展繁荣之基。无论从地理方位、自然环境还是相互关系看，周边对我国都具有重要影响。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 401,
    chapter: 16,
    type: "判断题",
    question: "中国外交秉持真实亲诚理念和正确义利观，加强同周边国家的团结合作。（   ）",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 402,
    chapter: 16,
    type: "判断题",
    question: "中国外交秉持亲诚惠容的周边外交理念，着力深化互利共嬴格局，找准同周边国家互利合作的战略契合点。（ ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 403,
    chapter: 16,
    type: "判断题",
    question: "中国外交秉持求同存异、相互尊重、互学互鉴理念，构建新型政党关系。（  ）",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 404,
    chapter: 17,
    type: "单选题",
    question: "全面建设社会主义现代化国家、全面推进中华民族伟大复兴，关键在党，关键在(   )。",
    options: {
      A: "党中央",
      B: "高质量发展",
      C: "全面从严治党",
      D: "维护党中央权威"
    },
    answer: "C"
  },
  {
    id: 405,
    chapter: 17,
    type: "单选题",
    question: "党的十九大强调，党的(   )是党的根本性建设，要摆在首位。",
    options: {
      A: "政治建设",
      B: "思想建设",
      C: "组织建设",
      D: "作风建设"
    },
    answer: "A"
  },
  {
    id: 406,
    chapter: 17,
    type: "单选题",
    question: "经过不懈努力，党找到了(   )这一跳出治乱兴衰历史周期率的第二个答案，确保党永远不变质、不...",
    options: {
      A: "新发展理念",
      B: "自我革命",
      C: "自我完善",
      D: "总体国家安全观"
    },
    answer: "B"
  },
  {
    id: 407,
    chapter: 17,
    type: "单选题",
    question: "(   )是党的建设的一贯要求和根本方针。",
    options: {
      A: "勇于自我革命",
      B: "党要管党、从严治党",
      C: "与时俱进",
      D: "“四个意识”和“两个维护”"
    },
    answer: "B"
  },
  {
    id: 408,
    chapter: 17,
    type: "单选题",
    question: "(   )是党的基础性建设。",
    options: {
      A: "政治建设",
      B: "思想建设",
      C: "制度建设",
      D: "作风建设"
    },
    answer: "B"
  },
  {
    id: 409,
    chapter: 17,
    type: "单选题",
    question: "坚持和加强党的全面领导，坚持党要管党、全面从严治党，以(   )为主线。",
    options: {
      A: "加强党的长期执政能力建设、先进性和纯洁性建设",
      B: "党的政治建设",
      C: "坚定理想信念宗旨",
      D: "调动全党积极性、主动性、创造性"
    },
    answer: "A"
  },
  {
    id: 410,
    chapter: 17,
    type: "单选题",
    question: "(   )就是要坚定理想信念宗旨，自觉抵御各种腐朽思想侵蚀，提高政治免疫力，清除一切侵蚀党的健康因素。",
    options: {
      A: "自我净化",
      B: "自我完善",
      C: "自我革新",
      D: "自我提高"
    },
    answer: "A"
  },
  {
    id: 411,
    chapter: 17,
    type: "单选题",
    question: "全面从严治党，核心是(   )。",
    options: {
      A: "加强党的领导",
      B: "落实全面从严治党体系",
      C: "坚持严字当头",
      D: "坚持标本兼治"
    },
    answer: "A"
  },
  {
    id: 412,
    chapter: 17,
    type: "多选题",
    question: "新形势下党执政面临的“四大危险”包括精神懈怠危险、(   )",
    options: {
      A: "能力不足危险",
      B: "脱离群众危险",
      C: "消极腐败危险",
      D: "动力不足考验"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 413,
    chapter: 17,
    type: "多选题",
    question: "全面从严治党，关键在严，“关键在严”，就是(   )。",
    options: {
      A: "坚持严字当头，把严的要求贯穿党的建设全过程",
      B: "做到真管真严、敢管敢严、长管长严",
      C: "敢于动真格，不降标准，不图形式，不走过场",
      D: "让一切违纪违规的言行无处遁形"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 414,
    chapter: 17,
    type: "多选题",
    question: "党的二十大报告指出，中国共产党立志于中华民族千秋伟业，致力于人类和平与发展崇高事业，全党同志要始终牢记“三个务必”，这“三个务必”是(  )。",
    options: {
      A: "务必不忘初心、牢记使命",
      B: "务必谦虚谨慎、艰苦奋斗",
      C: "务必贯彻好群众路线",
      D: "务必敢于斗争、善于斗争"
    },
    answer: ["A", "B", "D"]
  },
  {
    id: 415,
    chapter: 17,
    type: "多选题",
    question: "党的十八大以来，我们坚持党要管党、全面从严治党，坚持问题导向，以整治“四风”为突破口，“四风”包括:形式主义、(   )",
    options: {
      A: "官僚主义",
      B: "享乐主义",
      C: "奢靡之风",
      D: "利己主义"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 416,
    chapter: 17,
    type: "多选题",
    question: "全面从严治党，“要害在治”，就是( )。",
    options: {
      A: "要真正解决问题、切实担起责任",
      B: "从党中央到地方各级党委都要担负起主体责任",
      C: "各级纪委要担负起监督责任",
      D: "敢于瞪眼黑脸，勇于执纪问责",
      E: "坚持标本兼治，拔“烂树”、治“病树”、正“歪树”"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 412,
    chapter: 17,
    type: "多选题",
    question: "新形势下党执政面临的“四大危险”包括精神懈怠危险、(   )",
    options: {
      A: "能力不足危险",
      B: "脱离群众危险",
      C: "消极腐败危险",
      D: "动力不足考验"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 413,
    chapter: 17,
    type: "多选题",
    question: "全面从严治党，关键在严，“关键在严”，就是(   )。",
    options: {
      A: "坚持严字当头，把严的要求贯穿党的建设全过程",
      B: "做到真管真严、敢管敢严、长管长严",
      C: "敢于动真格，不降标准，不图形式，不走过场",
      D: "让一切违纪违规的言行无处遁形"
    },
    answer: ["A", "B", "C", "D"]
  },
  {
    id: 414,
    chapter: 17,
    type: "多选题",
    question: "党的二十大报告指出，中国共产党立志于中华民族千秋伟业，致力于人类和平与发展崇高事业，全党同志要始终牢记“三个务必”，这“三个务必”是(  )。",
    options: {
      A: "务必不忘初心、牢记使命",
      B: "务必谦虚谨慎、艰苦奋斗",
      C: "务必贯彻好群众路线",
      D: "务必敢于斗争、善于斗争"
    },
    answer: ["A", "B", "D"]
  },
  {
    id: 415,
    chapter: 17,
    type: "多选题",
    question: "党的十八大以来，我们坚持党要管党、全面从严治党，坚持问题导向，以整治“四风”为突破口，“四风”包括:形式主义、(   )",
    options: {
      A: "官僚主义",
      B: "享乐主义",
      C: "奢靡之风",
      D: "利己主义"
    },
    answer: ["A", "B", "C"]
  },
  {
    id: 416,
    chapter: 17,
    type: "多选题",
    question: "全面从严治党，“要害在治”，就是( )。",
    options: {
      A: "要真正解决问题、切实担起责任",
      B: "从党中央到地方各级党委都要担负起主体责任",
      C: "各级纪委要担负起监督责任",
      D: "敢于瞪眼黑脸，勇于执纪问责",
      E: "坚持标本兼治，拔“烂树”、治“病树”、正“歪树”"
    },
    answer: ["A", "B", "C", "D", "E"]
  },
  {
    id: 417,
    chapter: 17,
    type: "判断题",
    question: "政治建设是党永葆生机活力、走好新的赶考之路的必由之路。(   )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 418,
    chapter: 17,
    type: "判断题",
    question: "要以伟大社会革命引领伟大自我革命，以伟大自我革命促进伟大社会革命，确保党在新时代坚持和发展中国特色社会主义的历史进程中始终成为坚强领导核心。(   )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 419,
    chapter: 17,
    type: "判断题",
    question: "党的自我革新，就是要永不僵化、永不停滞，在学习实践中砥砺品格、增长才干，全面增强执政本领，不断提升政治境界、思想境界、道德境界，永葆党的生机活力。(   )",
    options: { A: "正确", B: "错误" },
    answer: "B"
  },
  {
    id: 420,
    chapter: 17,
    type: "判断题",
    question: "加强思想建设是坚守理想信念、坚定革命意志的前提。(   )",
    options: { A: "正确", B: "错误" },
    answer: "A"
  },
  {
    id: 421,
    chapter: 17,
    type: "判断题",
    question: "团结统一是党的生命，是党的力量所在。(   )",
    options: { A: "正确", B: "错误" },
    answer: "A"
  }





];

export default politicsQuestions;
